{
  "case_id": "end_04",
  "title": "Large Goiter Causing Airway Compression",
  "diagnosis_topic": "Multinodular goiter with tracheal deviation",
  "tags": [
    "endocrine",
    "goiter",
    "airway_compromise"
  ],
  "setup_script": "“A 65-year-old woman presents with progressive shortness of breath and difficulty swallowing. She has a longstanding multinodular goiter that has been enlarging. A CT scan shows a large substernal goiter compressing and deviating the trachea. How would you proceed with this patient?”",
  "dynamic_flow": [
    {
      "trigger": "If resident requests additional history",
      "reply": "“She reports worsening dyspnea when lying flat, some hoarseness, and progressive dysphagia. No history of radiation exposure.”"
    },
    {
      "trigger": "If resident performs physical exam",
      "reply": "“Neck exam shows a large, firm multinodular goiter with tracheal deviation to the right. No stridor. No evidence of superior vena cava syndrome.”"
    },
    {
      "trigger": "If resident orders thyroid function tests",
      "reply": "“TSH and free T4 are within normal limits.”"
    },
    {
      "trigger": "If resident requests imaging",
      "reply": "“CT scan confirms a large multinodular goiter with substernal extension compressing and deviating the trachea.”"
    },
    {
      "trigger": "If resident discusses indications for surgery",
      "reply": "“What are your surgical indications in this patient?”"
    },
    {
      "trigger": "If resident proposes thyroidectomy",
      "reply": "“What extent of thyroidectomy would you recommend? How does the substernal component influence your surgical approach?”"
    },
    {
      "trigger": "If resident discusses airway management",
      "reply": "“The anesthesiologist is concerned about a potentially difficult airway. How would you manage this situation?”"
    },
    {
      "trigger": "If resident delays airway planning",
      "reply": "“The patient develops stridor while awaiting surgery. What would you do next?”"
    },
    {
      "trigger": "If resident addresses intraoperative steps",
      "reply": "“During surgery, you encounter a large retrosternal component. Please describe your operative steps.”"
    },
    {
      "trigger": "If resident mentions risks",
      "reply": "“What are the major risks of this operation that you would discuss with the patient?”"
    },
    {
      "trigger": "If resident ensures hemostasis",
      "reply": "“After thyroidectomy, the patient develops neck swelling in recovery. What is your immediate management?”"
    },
    {
      "trigger": "If resident discusses postoperative care",
      "reply": "“The patient stabilizes. Calcium is 7.2 mg/dL the following morning and she reports tingling in her fingers. How will you manage this?”"
    },
    {
      "trigger": "If resident discusses pathology",
      "reply": "“Final pathology shows nodular hyperplasia with no evidence of malignancy. What is your follow-up plan?”"
    }
  ],
  "critical_decision_points": [
    "Recognition and management of airway compromise.",
    "Surgical planning: extent of resection, approach to substernal goiter.",
    "Airway strategy with anesthesia.",
    "Intraoperative protection of parathyroids and recurrent laryngeal nerves.",
    "Immediate recognition and management of postoperative hematoma.",
    "Postoperative management of hypocalcemia."
  ],
  "rubric": {
    "domains": {
      "diagnostic_reasoning": {
        "anchors": [],
        "weight": 0.3
      },
      "clinical_judgment": {
        "anchors": [],
        "weight": 0.3
      },
      "communication": {
        "anchors": [],
        "weight": 0.15
      },
      "surgical_knowledge": {
        "anchors": [],
        "weight": 0.15
      },
      "professionalism": {
        "anchors": [],
        "weight": 0.1
      }
    }
  },
  "resident_feedback_template": "Strengths: You demonstrated strong diagnostic reasoning by recognizing airway compression and planning surgery appropriately. Your surgical plan showed good knowledge of thyroidectomy indications and steps. Communication with the anesthesia team and emphasis on airway management was clear.Areas for Improvement: Earlier recognition of the urgency of airway compromise could be improved. Greater detail in postoperative monitoring and calcium management is recommended. Reinforce knowledge of emergent management of neck hematoma.Suggested Reading Topics: - SCORE Curriculum: Thyroid Disease and Surgery - Airway Management in Large Goiters (ASA Guidelines) - Postoperative Complications of Thyroid Surgery (hypocalcemia, hematoma, RLN injury)"
}