{
  "case_id": "eso_02",
  "title": "Barrett’s Esophagus with High-Grade Dysplasia",
  "diagnosis_topic": "Premalignant change in distal esophagus with high-grade dysplasia",
  "tags": [
    "esophagogastric",
    "barrett’s_esophagus",
    "dysplasia"
  ],
  "setup_script": "“A 48-year-old man with chronic gastroesophageal reflux disease undergoes surveillance endoscopy. The gastroenterologist notes a segment of salmon-colored mucosa in the distal esophagus. Biopsies are obtained, and pathology reports high-grade dysplasia. How would you proceed with this patient?”",
  "dynamic_flow": [
    {
      "trigger": "If resident requests pathology confirmation",
      "reply": "“Histology is reviewed by two independent GI pathologists, both confirming high-grade dysplasia without invasive carcinoma.”"
    },
    {
      "trigger": "If resident discusses management options",
      "reply": "“What treatment approaches are available for this patient?”"
    },
    {
      "trigger": "If resident chooses endoscopic eradication therapy",
      "reply": "“Endoscopic mucosal resection is performed on nodular areas. Pathology confirms high-grade dysplasia without invasion. Radiofrequency ablation is then applied to the remaining Barrett’s segment. What is your surveillance plan?”"
    },
    {
      "trigger": "If resident selects surveillance alone",
      "reply": "“Three months later, repeat endoscopy shows progression with nodularity and multifocal high-grade dysplasia. How do you proceed?”"
    },
    {
      "trigger": "If resident delays intervention",
      "reply": "“The patient presents six months later with dysphagia. Biopsies reveal intramucosal adenocarcinoma. What is your management now?”"
    },
    {
      "trigger": "If resident considers esophagectomy",
      "reply": "“What operative approach would you consider, and why?”"
    },
    {
      "trigger": "If resident begins esophagectomy",
      "reply": "“Please describe your operative steps for an Ivor Lewis or transhiatal esophagectomy.”"
    },
    {
      "trigger": "If resident performs esophagectomy",
      "reply": "“Pathology reveals high-grade dysplasia throughout and no invasive carcinoma. The patient recovers uneventfully. How will you structure follow-up?”"
    },
    {
      "trigger": "If resident prescribes acid suppression",
      "reply": "“The patient is started on high-dose proton pump inhibitor therapy. What is the role of ongoing acid suppression?”"
    },
    {
      "trigger": "If resident discusses lifestyle modifications",
      "reply": "“The patient asks what changes he can make to reduce risk of recurrence or progression.”"
    },
    {
      "trigger": "If resident asks about H. pylori",
      "reply": "“Testing is negative for H. pylori.”"
    },
    {
      "trigger": "If resident addresses patient education",
      "reply": "“The patient asks about his risk of cancer in the future. How do you counsel him?”"
    }
  ],
  "critical_decision_points": [
    "Confirmation of high-grade dysplasia by expert pathology",
    "Decision between endoscopic eradication therapy and surgical esophagectomy",
    "Technical performance and intraoperative decision-making if esophagectomy is performed",
    "Appropriate use of surveillance vs. intervention",
    "Importance of acid suppression and lifestyle modification",
    "Patient education and counseling on risk of progression"
  ],
  "rubric": {
    "domains": {
      "diagnostic_reasoning": {
        "anchors": [
          {
            "score": 1,
            "description": "Fails to recognize Barrett’s esophagus with high-grade dysplasia or misattributes findings."
          },
          {
            "score": 2,
            "description": "Delayed or incomplete differential, overlooks key features."
          },
          {
            "score": 3,
            "description": "Recognizes Barrett’s with dysplasia but omits alternatives."
          },
          {
            "score": 4,
            "description": "Develops comprehensive differential and rules out other causes."
          },
          {
            "score": 5,
            "description": "Rapidly identifies high-grade dysplasia with complete, well-supported differential."
          }
        ],
        "weight": 0.3
      },
      "clinical_judgment": {
        "anchors": [
          {
            "score": 1,
            "description": "Misses urgency, no intervention."
          },
          {
            "score": 2,
            "description": "Recognizes urgency but delays action."
          },
          {
            "score": 3,
            "description": "Initiates workup but misses key timing/steps."
          },
          {
            "score": 4,
            "description": "Prioritizes timely definitive therapy."
          },
          {
            "score": 5,
            "description": "Anticipates complications, coordinates care, makes timely decisions."
          }
        ],
        "weight": 0.3
      },
      "communication": {
        "anchors": [
          {
            "score": 1,
            "description": "Disorganized, unclear, lacks empathy."
          },
          {
            "score": 2,
            "description": "Provides information but unclear/incomplete."
          },
          {
            "score": 3,
            "description": "Clear but misses confirmation of understanding."
          },
          {
            "score": 4,
            "description": "Communicates clearly, logically, empathetically."
          },
          {
            "score": 5,
            "description": "Exemplary , anticipates patient/team needs."
          }
        ],
        "weight": 0.15
      },
      "surgical_knowledge": {
        "anchors": [
          {
            "score": 1,
            "description": "Lacks understanding of management for Barrett’s with dysplasia; unable to describe esophagectomy."
          },
          {
            "score": 2,
            "description": "Identifies operative options but with major gaps in technique/indications."
          },
          {
            "score": 3,
            "description": "Describes key operative steps with omissions or uncertainties; limited understanding of alternatives."
          },
          {
            "score": 4,
            "description": "Provides complete description of esophagectomy techniques, perioperative care, and alternatives."
          },
          {
            "score": 5,
            "description": "Demonstrates mastery of operative approach, technical steps, complication avoidance, and evidence-based perioperative considerations."
          }
        ],
        "weight": 0.15
      },
      "professionalism": {
        "anchors": [
          {
            "score": 1,
            "description": "Disrespectful, breaches confidentiality."
          },
          {
            "score": 2,
            "description": "Inconsistent respect, lapses in accountability."
          },
          {
            "score": 3,
            "description": "Maintains respect but requires prompting."
          },
          {
            "score": 4,
            "description": "Consistently respectful, accountable, receptive to feedback."
          },
          {
            "score": 5,
            "description": "Role model: humility, cultural sensitivity, ethical behavior."
          }
        ],
        "weight": 0.1
      }
    }
  },
  "resident_feedback_template": "Strengths:You demonstrated strong diagnostic reasoning by promptly recognizing Barrett’s esophagus with high-grade dysplasia and appropriately considering both endoscopic and surgical management. Your operative description of esophagectomy was structured and complete.Areas for Improvement:Strengthen your management approach by explicitly addressing surveillance schedules and the role of acid suppression after therapy. Be more detailed in describing technical steps and perioperative considerations for esophagectomy.Suggested Reading:- SCORE: Barrett’s Esophagus and Esophageal Dysplasia- ASE Core Curriculum: Esophagectomy – operative approaches and outcomes- NCCN Guidelines: Esophageal and Esophagogastric Junction Cancers"
}