{
    "case_id": "scenario_8_chest_pain_after_retching",
    "title": "Scenario 8: Esophageal and Gastric",
    "diagnosis_topic": "Acute Chest Pain Following Retching",
    "setup_script": "A 68-year-old male with a history of alcohol use disorder presents to the emergency department with severe chest and epigastric pain that began suddenly after forceful vomiting following an alcoholic binge. He reports the pain radiates to his back and is worsened by swallowing. Vital signs show: Temperature 38.2°C, HR 115, BP 138/88, RR 24, O2 saturation 94% on room air. On examination, he appears uncomfortable with subcutaneous emphysema in the neck and upper chest. Initial labs show: WBC 15,800/μL, Hgb 14.2 g/dL, lactate 2.8 mmol/L. How would you proceed with this patient?",
    "dynamic_flow": [
        {
            "trigger": "If resident requests chest X-ray",
            "reply": "Chest X-ray shows pneumomediastinum and left pleural effusion without pneumothorax."
        },
        {
            "trigger": "If resident requests esophagram or CT",
            "reply": "CT with oral contrast shows extravasation of contrast in the distal esophagus with pneumomediastinum and a moderate left pleural effusion containing contrast material."
        },
        {
            "trigger": "If resident initiates appropriate initial management",
            "reply": "What specific interventions will you order for this patient?"
        },
        {
            "trigger": "If resident doesn't address NPO, IV antibiotics, and fluid resuscitation",
            "reply": "The patient continues to deteriorate with worsening tachycardia and increasing oxygen requirements. What might you be missing in your initial management?"
        },
        {
            "trigger": "If resident proposes surgical intervention",
            "reply": "What factors would influence your decision between non-operative and operative management for this patient?"
        },
        {
            "trigger": "If resident recommends immediate surgery",
            "reply": "Describe your operative approach and specific technique for this distal esophageal perforation."
        },
        {
            "trigger": "If resident discusses thoracic approach",
            "reply": "During left thoracotomy, you identify a 3 cm longitudinal tear in the left distal esophagus with surrounding mediastinal contamination. How will you manage this defect and the contaminated field?"
        },
        {
            "trigger": "If resident doesn't address drainage",
            "reply": "The patient develops fever and increasing oxygen requirements on postoperative day 3. Repeat imaging shows a loculated fluid collection in the left pleural space. What is your management plan now?"
        }
    ],
    "critical_decision_points": [
        "Rapid recognition of Boerhaave's syndrome",
        "Appropriate diagnostic studies",
        "Initial management decisions (NPO, broad-spectrum antibiotics, fluid resuscitation)",
        "Decision regarding operative vs. non-operative management",
        "Surgical approach and technique",
        "Management of contamination and drainage",
        "Postoperative care and management of complications",
        "Nutritional support considerations"
    ],
    "rubric": {
        "diagnostic_reasoning": [
            "Fails to recognize esophageal perforation despite clinical presentation",
            "Delayed recognition, incomplete differential diagnosis",
            "Recognizes likely esophageal perforation, orders appropriate studies",
            "Prompt identification with appropriate diagnostic approach",
            "Excellent diagnostic reasoning with comprehensive differential and efficient use of diagnostic studies"
        ]
    }
}