{"case_id":"scenario_11_progressive_cellulitis_systemic_symptoms","title":"Scenario 11: Necrotizing Soft Tissue Infection (Soft Tissue/Skin)","diagnosis_topic":"Progressive Cellulitis with Systemic Symptoms","setup_script":"A 56-year-old male with poorly controlled diabetes (HbA1c 11.2%) presents to the emergency department with rapidly worsening pain, swelling, and redness of his right lower extremity over the past 48 hours. He reports a minor abrasion on his shin 4 days ago while gardening. He now has severe pain that seems disproportionate to the physical findings. Vital signs show: Temperature 39.0°C, HR 126, BP 92/58, RR 24, O2 saturation 95% on room air. On examination, his right leg shows erythema, edema, and areas of dusky discoloration with a few small bullae. The area is exquisitely tender, and you note crepitus on palpation. Initial labs show: WBC 22,000/μL with 18% bands, sodium 130 mEq/L, creatinine 1.9 mg/dL, glucose 380 mg/dL, lactate 4.1 mmol/L. How would you proceed with this patient?","dynamic_flow":[{"trigger":"If resident initiates appropriate resuscitation","reply":"You start IV fluids and broad-spectrum antibiotics. The patient remains hypotensive after 2L of fluid. What additional steps will you take?"},{"trigger":"If resident doesn't address vasopressors and ICU","reply":"The patient's blood pressure continues to drop to 80/45 despite fluid resuscitation. How will you manage this?"},{"trigger":"If resident recognizes necrotizing soft tissue infection","reply":"What specific clinical and laboratory findings support your diagnosis of necrotizing fasciitis?"},{"trigger":"If resident recommends immediate surgical exploration","reply":"Describe your approach to the surgical exploration and debridement."},{"trigger":"Intraoperative scenario","reply":"On entering the deep fascia, you encounter dishwater-gray fluid with necrotic fascia that does not bleed when cut and separates easily from underlying muscle with minimal resistance to blunt dissection. How extensive should your debridement be?"},{"trigger":"If resident doesn't address margins of debridement","reply":"After performing what you believe is adequate debridement, you notice a small area of questionable tissue viability at the proximal margin. What will you do?"},{"trigger":"Postoperative scenario","reply":"The patient requires three debridements, resulting in a large soft tissue defect involving most of the anterior compartment of the right lower leg. How will you manage this defect?"},{"trigger":"If resident doesn't address nutritional support","reply":"The patient's albumin is now 2.2 g/dL and he has lost 10 pounds since admission. What aspects of his metabolic support need to be addressed?"}],"critical_decision_points":["Rapid recognition of necrotizing soft tissue infection","Appropriate resuscitation including antibiotics and hemodynamic support","Decision for emergent surgical intervention","Extent of surgical debridement","Need for serial debridements","Management of the resulting soft tissue defect","Nutritional support and glycemic control","Recognition and management of complications"],"rubric":{"diagnostic_reasoning":["Fails to recognize necrotizing soft tissue infection despite clinical presentation","Delayed recognition, attributes findings to cellulitis only","Recognizes necrotizing infection based on clinical findings","Prompt identification with good understanding of risk factors and laboratory findings","Excellent diagnostic reasoning with comprehensive assessment including LRINEC score and gas-forming organisms"],"clinical_judgment":["Inappropriate management plan, delays surgical intervention","Basic plan but inadequate resuscitation or delayed surgery","Appropriate resuscitation and timely surgical intervention","Good clinical judgment regarding resuscitation, antibiotics, and extent of debridement","Excellent judgment throughout with appropriate prioritization, recognition of septic shock, and management of all aspects of care"],"communication":["Disorganized presentation, unable to articulate urgency","Basic explanation but lack of clarity about severity","Clear communication of diagnosis and need for urgent intervention","Well-organized presentation with good explanation of life-threatening nature","Exceptionally clear communication demonstrating leadership in emergency situation, clear team direction, and effective family communication"],"surgical_knowledge":["Inadequate knowledge of necrotizing infection pathophysiology and surgical approach","Basic understanding of debridement but limited knowledge of extent needed","Adequate knowledge of surgical approach and need for complete debridement","Good knowledge of surgical techniques, recognition of tissue planes, and reconstruction options","Excellent knowledge of all technical aspects, microbiological considerations, and comprehensive management including reconstruction"],"professionalism":["Does not appropriately mobilize necessary resources","Minimal team coordination, ineffective leadership","Appropriate coordination with critical care, infectious disease, and other services","Good leadership in emergency setting, effective communication with entire team","Excellent team leadership, appropriate delegation, and maintenance of composure in high-stress situation"]},"resident_feedback_template":"Your performance on this necrotizing soft tissue infection scenario demonstrated [strengths in diagnosis/resuscitation/surgical management]. You correctly [specific positive actions]. Areas for improvement include [specific areas needing improvement]. Consider reviewing the management of necrotizing fasciitis, particularly regarding [specific knowledge gap]. Recommended reading includes current guidelines on management of necrotizing soft tissue infections, surgical debridement techniques, and reconstruction options for large soft tissue defects.","learner_feedback_questions":["How realistic was this scenario? (1-5 scale)","How helpful was this scenario in preparing you for the oral boards? (1-5 scale)","Was the difficulty level appropriate? (Too easy / Appropriate / Too difficult)","Were the examiner prompts clear and helpful? (1-5 scale)","What aspects of this scenario were most valuable to your learning?","What suggestions do you have to improve this scenario?","Additional comments or feedback:"]}