{"case_id":"scenario_10_thyroid_nodule_suspicious_features","title":"Scenario 10: Thyroid Cancer (Endocrine Surgery)","diagnosis_topic":"Thyroid Nodule with Suspicious Features","setup_script":"A 45-year-old female presents to your clinic after her primary care physician felt a lump in her neck during a routine physical examination. She has no symptoms, denies dysphagia or dysphonia, and has no prior history of radiation exposure. She has a family history of hypothyroidism but no family history of thyroid cancer. On examination, you palpate a 2.5 cm firm, non-tender nodule in the right thyroid lobe without palpable lymphadenopathy. Thyroid function tests are normal. How would you proceed with this patient?","dynamic_flow":[{"trigger":"If resident requests appropriate initial imaging","reply":"Ultrasound shows a 2.8 cm solid, hypoechoic nodule with irregular margins, microcalcifications, and increased vascularity in the right thyroid lobe. There are also two suspicious-appearing right level VI lymph nodes."},{"trigger":"If resident discusses risk stratification","reply":"How would you classify this nodule based on ultrasound characteristics, and what would be your next step?"},{"trigger":"If resident recommends FNA","reply":"FNA of the thyroid nodule is reported as Bethesda Category V (suspicious for papillary thyroid carcinoma). FNA of a central compartment lymph node shows metastatic papillary thyroid carcinoma. What is your management plan?"},{"trigger":"If resident recommends surgery","reply":"What extent of thyroid surgery and lymph node dissection would you recommend for this patient?"},{"trigger":"If resident recommends total thyroidectomy with central neck dissection","reply":"During surgery, you identify an enlarged right superior parathyroid gland that appears to be involved by tumor. What will you do?"},{"trigger":"If resident doesn't address recurrent laryngeal nerve","reply":"While dissecting near the ligament of Berry, you note that the right recurrent laryngeal nerve appears to be adherent to the tumor. How will you proceed?"},{"trigger":"Postoperative scenario","reply":"Final pathology confirms a 3.2 cm classical variant papillary thyroid carcinoma with microscopic extrathyroidal extension and 4 of 8 positive central compartment lymph nodes. There is no vascular invasion. What additional management would you recommend?"},{"trigger":"If resident doesn't address RAI","reply":"What factors would influence your decision regarding radioactive iodine therapy in this patient?"}],"critical_decision_points":["Appropriate initial evaluation of thyroid nodule","Interpretation of ultrasound findings and risk stratification","Proper utilization of FNA and interpretation of results","Decision regarding extent of surgery (lobectomy vs. total thyroidectomy)","Management of central compartment lymph nodes","Intraoperative decision-making regarding parathyroid and recurrent laryngeal nerve","Postoperative management including RAI considerations","Long-term surveillance planning"],"rubric":{"diagnostic_reasoning":["Inadequate workup of thyroid nodule","Basic workup but missing key elements of risk stratification","Appropriate diagnostic workup with ultrasound and FNA","Comprehensive diagnostic approach with attention to lymph node evaluation","Excellent diagnostic reasoning with thorough risk assessment and preoperative planning"],"clinical_judgment":["Inappropriate management plan (e.g., observation of high-risk nodule)","Basic plan but failing to address lymph node status","Appropriate surgical planning based on FNA results","Good clinical judgment regarding extent of surgery and approach to lymph nodes","Excellent judgment throughout with appropriate decision-making for all aspects of care including parathyroid management"],"communication":["Disorganized presentation, unable to explain management rationale","Basic explanation but lacks detail on risks and benefits","Clear communication of diagnosis and surgical plan","Well-organized presentation with good explanation of risks including RLN injury","Exceptionally clear communication with excellent discussion of all surgical risks and postoperative management"],"surgical_knowledge":["Inadequate knowledge of thyroid anatomy and cancer management","Basic understanding of thyroidectomy but limited knowledge of neck dissection","Adequate knowledge of thyroid surgery principles and lymph node management","Good knowledge of technical aspects, RLN and parathyroid preservation strategies","Excellent knowledge of all technical aspects, staging considerations, and contemporary risk-stratified approach to thyroid cancer"],"professionalism":["Does not address patient concerns about surgical risks or alternatives","Minimal discussion of risks or long-term implications","Appropriate discussion of surgical risks and benefits","Good attention to shared decision-making and quality of life concerns","Excellent patient-centered approach with comprehensive discussion of immediate and long-term management"]},"resident_feedback_template":"Your performance on this thyroid cancer scenario demonstrated [strengths in diagnosis/surgical planning/technical knowledge]. You correctly [specific positive actions]. Areas for improvement include [specific areas needing improvement]. Consider reviewing the management of papillary thyroid carcinoma, particularly regarding [specific knowledge gap]. Recommended reading includes the current ATA guidelines for thyroid nodules and differentiated thyroid cancer, technical considerations for central neck dissection, and management of the recurrent laryngeal nerve.","learner_feedback_questions":["How realistic was this scenario? (1-5 scale)","How helpful was this scenario in preparing you for the oral boards? (1-5 scale)","Was the difficulty level appropriate? (Too easy / Appropriate / Too difficult)","Were the examiner prompts clear and helpful? (1-5 scale)","What aspects of this scenario were most valuable to your learning?","What suggestions do you have to improve this scenario?","Additional comments or feedback:"]}