{"case_id":"scenario_6_sudden_abdominal_back_pain","title":"Scenario 6: Vascular Surgery","diagnosis_topic":"Sudden Onset Severe Abdominal and Back Pain","setup_script":"A 72-year-old male smoker with hypertension and COPD presents to the emergency department with sudden onset severe abdominal and back pain that began 2 hours ago. He describes the pain as 'tearing' and the worst pain he's ever felt. Vital signs show: BP 85/50 (right arm), 90/55 (left arm), HR 124, RR 24, O2 saturation 92% on room air. On examination, he appears diaphoretic and in obvious distress. His abdomen is diffusely tender with a palpable, pulsatile mass. Femoral pulses are weak bilaterally. Initial labs show: Hgb 9.8 g/dL, WBC 14,200/μL, creatinine 1.7 mg/dL, lactate 3.8 mmol/L. How would you proceed with this patient?","dynamic_flow":[{"trigger":"If resident initiates resuscitation","reply":"You start large-bore IV access and begin fluid resuscitation. The patient's BP temporarily improves to 95/60 but then drops again. What specific imaging would you order, if any?"},{"trigger":"If resident requests CT angiogram","reply":"The CT shows a 7.5 cm infrarenal abdominal aortic aneurysm with active extravasation and a large retroperitoneal hematoma. What is your next step?"},{"trigger":"If resident delays intervention to obtain more imaging","reply":"While awaiting further studies, the patient becomes more hypotensive (BP 70/40) and increasingly agitated. How does this change your management?"},{"trigger":"If resident calls for immediate operative intervention","reply":"What specific approach would you use for this ruptured AAA? Open or endovascular?"},{"trigger":"If resident chooses open repair","reply":"Describe your approach to proximal and distal control and the technical steps of the repair."},{"trigger":"If resident chooses EVAR","reply":"What anatomic factors would you need to consider for endovascular repair, and what are the relative advantages and disadvantages in this unstable patient?"},{"trigger":"If resident does not address critical care considerations","reply":"After successful repair, the patient develops progressive oliguria and hypoxemia in the ICU. What complications are you concerned about, and how would you manage them?"},{"trigger":"If resident does not discuss abdominal compartment syndrome","reply":"The patient has increasing ventilator requirements, peak airway pressures are rising, and bladder pressure is measured at 28 mmHg. What is your diagnosis and management plan?"}],"critical_decision_points":["Rapid recognition of ruptured AAA","Appropriate resuscitation strategy (permissive hypotension)","Decision regarding open vs. endovascular repair","Technical considerations for aneurysm repair","Recognition and management of postoperative complications (renal failure, respiratory failure, abdominal compartment syndrome)","ICU management including ventilator support and hemodynamic monitoring"],"rubric":{"diagnostic_reasoning":["Fails to recognize ruptured AAA despite clinical presentation","Delayed recognition, requests unnecessary imaging in unstable patient","Correctly identifies likely ruptured AAA, orders appropriate imaging","Prompt identification of ruptured AAA with limited, targeted diagnostic testing","Excellent diagnostic approach with rapid recognition based on clinical findings and efficient use of imaging"],"clinical_judgment":["Inappropriate management with dangerous delays in intervention","Inadequate resuscitation, poor prioritization of interventions","Appropriate recognition of need for surgical intervention with adequate resuscitation","Good clinical judgment with balanced resuscitation and rapid surgical planning","Excellent judgment throughout with appropriate permissive hypotension, rapid intervention, and anticipation of complications"],"communication":["Disorganized presentation, unable to articulate emergent nature of situation","Basic explanation of findings but lacks urgency in communication","Clear communication of diagnosis and need for urgent intervention","Well-organized, systematic presentation with clear explanation of critical nature","Exceptional communication demonstrating leadership in emergency situation, clear team direction, and effective prioritization"],"surgical_knowledge":["Inadequate knowledge of AAA anatomy and repair options","Basic understanding of repair but limited knowledge of techniques","Adequate knowledge of open and endovascular options","Good knowledge of technical aspects of repair and postoperative management","Excellent knowledge of complex aortic anatomy, technical considerations for both open and endovascular approaches, and comprehensive postoperative management"],"professionalism":["Does not appropriately mobilize necessary resources","Minimal team coordination, ineffective leadership","Appropriate coordination with vascular team, anesthesia, and blood bank","Good leadership in emergency setting, effective communication with entire team","Excellent team leadership, appropriate delegation, and maintenance of composure in high-stress situation"]},"resident_feedback_template":"Your performance on this ruptured AAA scenario demonstrated [strengths in diagnosis/resuscitation/operative planning]. You correctly [specific positive actions]. Areas for improvement include [specific areas needing improvement]. Consider reviewing the management of ruptured AAA, particularly regarding [specific knowledge gap]. Recommended reading includes Society for Vascular Surgery guidelines on management of ruptured abdominal aortic aneurysms, permissive hypotension strategies, and management of abdominal compartment syndrome.","learner_feedback_questions":["How realistic was this scenario? (1-5 scale)","How helpful was this scenario in preparing you for the oral boards? (1-5 scale)","Was the difficulty level appropriate? (Too easy / Appropriate / Too difficult)","Were the examiner prompts clear and helpful? (1-5 scale)","What aspects of this scenario were most valuable to your learning?","What suggestions do you have to improve this scenario?","Additional comments or feedback:"]}