{
  "case_id": "sst_04",
  "title": "Cutaneous Melanoma",
  "diagnosis_topic": "Cutaneous Melanoma – Diagnosis, Staging, and Surgical Management",
  "tags": [
    "surgical_oncology",
    "skin_cancer",
    "lymph_node_management",
    "oncologic_surgery"
  ],
  "setup_script": "“A 45-year-old male presents to your clinic after his dermatologist biopsied a pigmented lesion on his upper back. The pathology confirmed melanoma. He has no significant past medical history. The biopsy site is healing well, and there is no palpable lymphadenopathy on exam. How would you proceed?”",
  "dynamic_flow": [
    {
      "trigger": "If resident asks for biopsy details",
      "reply": "- “The pathology report shows malignant melanoma with Breslow depth 2.2 mm, non-ulcerated, mitotic rate 2/mm².”"
    },
    {
      "trigger": "If resident fails to ask for biopsy details",
      "reply": "- “The pathology report confirms melanoma, but you have not yet reviewed the histologic characteristics. Would you like that information?”"
    },
    {
      "trigger": "If resident recommends wide local excision",
      "reply": "- “What surgical margins are appropriate for this melanoma?”"
    },
    {
      "trigger": "If resident specifies 2 cm margin",
      "reply": "- “You schedule him for wide local excision with a 2 cm margin. What additional procedure should you consider at the time of surgery?”"
    },
    {
      "trigger": "If resident mentions sentinel lymph node biopsy (SLNB)",
      "reply": "- “You perform SLNB. Pathology reveals 1 of 3 sentinel nodes positive for melanoma. How does this change management?”"
    },
    {
      "trigger": "If resident fails to mention SLNB",
      "reply": "- “Final pathology shows a 2.2 mm melanoma with no lymph node evaluation performed. What is the implication of this omission?”"
    },
    {
      "trigger": "If resident discusses completion lymph node dissection",
      "reply": "- “Current guidelines recommend against routine completion dissection. What alternative management should be offered?”"
    },
    {
      "trigger": "If resident mentions adjuvant immunotherapy",
      "reply": "- “The patient is referred to medical oncology and started on adjuvant PD-1 inhibitor therapy. What follow-up strategy do you recommend?”"
    },
    {
      "trigger": "If resident delays or mismanages staging",
      "reply": "- “The patient presents 6 months later with a new palpable axillary mass. What would you do now?”"
    },
    {
      "trigger": "If resident appropriately stages recurrence",
      "reply": "- “PET/CT shows isolated axillary nodal disease without distant metastasis. How would you manage this?”"
    },
    {
      "trigger": "If resident suggests lymphadenectomy",
      "reply": "- “You perform a therapeutic lymph node dissection. Pathology shows 3 of 12 nodes positive. What adjuvant options are available now?”"
    }
  ],
  "critical_decision_points": [
    "Interpretation of pathology (Breslow depth, ulceration, mitotic rate)",
    "Selection of surgical margins for excision",
    "Recognition of sentinel lymph node biopsy indication",
    "Management of positive sentinel node (no longer routine completion dissection)",
    "Knowledge of adjuvant systemic therapy (immunotherapy, targeted therapy)",
    "Appropriate surveillance and follow-up strategies",
    "Management of nodal recurrence"
  ],
  "rubric": {
    "domains": {
      "diagnostic_reasoning": {
        "anchors": [
          {
            "score": 1,
            "description": "Fails to recognize key pathology features or staging importance"
          },
          {
            "score": 2,
            "description": "Partial interpretation, misses sentinel node indication"
          },
          {
            "score": 3,
            "description": "Correctly interprets melanoma depth and staging"
          },
          {
            "score": 4,
            "description": "Accurate staging, integrates pathology and physical exam"
          },
          {
            "score": 5,
            "description": "Excellent , comprehensive staging including nodal evaluation and systemic risk factors"
          }
        ],
        "weight": 0.3
      },
      "clinical_judgment": {
        "anchors": [
          {
            "score": 1,
            "description": "Inappropriate margins, omits sentinel node biopsy"
          },
          {
            "score": 2,
            "description": "Delayed or incomplete management decisions"
          },
          {
            "score": 3,
            "description": "Recommends appropriate excision and SLNB"
          },
          {
            "score": 4,
            "description": "Good judgment incorporating adjuvant therapy and surveillance"
          },
          {
            "score": 5,
            "description": "Excellent sequencing of surgery, nodal staging, systemic therapy, and surveillance planning"
          }
        ],
        "weight": 0.3
      },
      "communication": {
        "anchors": [
          {
            "score": 1,
            "description": "Disorganized or unclear plan"
          },
          {
            "score": 2,
            "description": "Partially clear, but incomplete explanation"
          },
          {
            "score": 3,
            "description": "Communicates plan for excision and SLNB clearly"
          },
          {
            "score": 4,
            "description": "Well-organized, systematic explanation with rationale"
          },
          {
            "score": 5,
            "description": "Exceptionally clear, structured  of multidisciplinary management and follow-up"
          }
        ],
        "weight": 0.15
      },
      "surgical_knowledge": {
        "anchors": [
          {
            "score": 1,
            "description": "Poor knowledge of excision margins and SLNB indications"
          },
          {
            "score": 2,
            "description": "Basic understanding, incomplete or outdated approach"
          },
          {
            "score": 3,
            "description": "Adequate knowledge of surgical margins and sentinel node biopsy"
          },
          {
            "score": 4,
            "description": "Good understanding of nodal management and adjuvant therapy principles"
          },
          {
            "score": 5,
            "description": "Excellent knowledge of current melanoma guidelines, systemic therapies, and recurrence management"
          }
        ],
        "weight": 0.15
      },
      "professionalism": {
        "anchors": [
          {
            "score": 1,
            "description": "Does not discuss multidisciplinary approach"
          },
          {
            "score": 2,
            "description": "Minimal collaboration with oncology team"
          },
          {
            "score": 3,
            "description": "Appropriate referral to oncology and dermatology colleagues"
          },
          {
            "score": 4,
            "description": "Good team communication, involves multidisciplinary care"
          },
          {
            "score": 5,
            "description": "Exemplary , coordinates multidisciplinary care, addresses patient-centered concerns and survivorship"
          }
        ],
        "weight": 0.1
      }
    }
  },
  "resident_feedback_template": "Strengths:“You demonstrated strong diagnostic reasoning in interpreting the melanoma pathology and appropriately recommending wide excision and sentinel lymph node biopsy. Your communication of the surgical plan was clear and systematic.”Areas for Improvement:“Consider earlier integration of adjuvant therapy and long-term surveillance into your management plan. A more detailed discussion of recurrence management and evolving guideline changes for nodal disease would strengthen your performance.”Suggested Reading Topics:- Surgical Management of Melanoma (SCORE Curriculum)- NCCN Guidelines for Melanoma- Sentinel Lymph Node Biopsy and Adjuvant Therapy in Melanoma"
}