{
  "case_id": "scenario_7_rectal_bleeding_bowel_habits",
  "title": "Scenario 7: Colorectal",
  "diagnosis_topic": "Rectal Bleeding and Change in Bowel Habits",
  "setup_script": "A 52-year-old male presents to your clinic with a 4-month history of intermittent rectal bleeding, change in bowel habits with increasing constipation, and narrow-caliber stools. He also reports a 15-pound unintentional weight loss over the past 6 months. He has no significant past medical history and no family history of colorectal cancer. On digital rectal examination, you palpate a firm, irregular mass approximately 6 cm from the anal verge on the anterior rectal wall. How would you proceed with this patient?",
  "dynamic_flow": [
    {
      "trigger": "If resident requests appropriate workup",
      "reply": "Colonoscopy confirms a 4 cm circumferential, ulcerated mass at 6 cm from the anal verge. Biopsy shows moderately differentiated adenocarcinoma."
    },
    {
      "trigger": "If resident orders staging studies",
      "reply": "CT chest/abdomen/pelvis shows no evidence of distant metastases. Pelvic MRI shows a T3N1 rectal cancer with threatened circumferential resection margin (CRM) and extramural vascular invasion (EMVI). There is no involvement of the levator ani muscles or sphincter complex."
    },
    {
      "trigger": "If resident discusses treatment options",
      "reply": "What is your recommendation for the initial approach to this locally advanced rectal cancer?"
    },
    {
      "trigger": "If resident recommends neoadjuvant therapy",
      "reply": "The patient completes neoadjuvant chemoradiation. Repeat MRI shows significant tumor regression with T2N0 disease and clear CRM. What surgical approach would you recommend now?"
    },
    {
      "trigger": "If resident discusses technical aspects of TME",
      "reply": "Describe the key technical considerations for total mesorectal excision in this mid-rectal cancer."
    },
    {
      "trigger": "If resident doesn't address sphincter preservation",
      "reply": "The patient is very concerned about the possibility of a permanent colostomy. What factors would influence your decision regarding sphincter preservation?"
    },
    {
      "trigger": "If resident recommends low anterior resection",
      "reply": "During the operation, after completing TME and transecting the rectum distally, you find that the distal margin appears inadequate. What are your options at this point?"
    },
    {
      "trigger": "If resident discusses temporary diverting ileostomy",
      "reply": "What criteria would you use to determine the need for a diverting ileostomy in this patient?"
    },
    {
      "trigger": "If resident doesn't address postoperative surveillance",
      "reply": "The final pathology shows ypT2N0 with negative margins. What surveillance plan would you recommend?"
    }
  ],
  "critical_decision_points": [
    "Appropriate diagnostic workup for rectal cancer",
    "Accurate staging and understanding of prognostic factors (CRM, EMVI)",
    "Decision regarding neoadjuvant therapy",
    "Surgical planning including approach to TME",
    "Technical considerations for sphincter preservation",
    "Management of challenging distal margin",
    "Decision regarding diverting ileostomy",
    "Postoperative surveillance plan"
  ],
  "rubric": {
    "diagnostic_reasoning": [
      "Inadequate workup of rectal bleeding and mass",
      "Basic workup but missing important elements of staging",
      "Appropriate diagnostic workup and standard staging",
      "Comprehensive diagnostic approach with attention to key prognostic factors",
      "Excellent diagnostic reasoning with thorough staging and consideration of all relevant prognostic features"
    ],
    "clinical_judgment": [
      "Inappropriate treatment sequencing for locally advanced rectal cancer",
      "Basic understanding of treatment but incorrect sequencing",
      "Appropriate recommendation for neoadjuvant therapy followed by surgery",
      "Good clinical judgment regarding treatment sequencing and surgical planning",
      "Excellent judgment throughout with nuanced approach to treatment sequencing, surgical planning, and consideration of patient preferences"
    ],
    "communication": [
      "Disorganized presentation, unable to explain treatment rationale",
      "Basic explanation of findings and plan but lacks detail",
      "Clear communication of diagnosis, staging, and treatment plan",
      "Well-organized presentation with good explanation of complex treatment decisions",
      "Exceptionally clear communication with excellent explanation of complex multidisciplinary approach and thoughtful discussion of quality of life considerations"
    ],
    "surgical_knowledge": [
      "Inadequate knowledge of rectal cancer surgery principles",
      "Basic understanding of TME but limited technical knowledge",
      "Adequate knowledge of TME principles and technical approach",
      "Good knowledge of surgical anatomy, TME technique, and sphincter preservation options",
      "Excellent knowledge of complex rectal surgical anatomy, technical nuances of TME, sphincter preservation techniques, and management of intraoperative challenges"
    ],
    "professionalism": [
      "Does not involve multidisciplinary team appropriately",
      "Minimal consideration of patient preferences or quality of life",
      "Appropriate multidisciplinary approach and consideration of patient preferences",
      "Good communication with multidisciplinary team and patient-centered approach",
      "Excellent patient advocacy, clear communication about quality of life implications, and comprehensive multidisciplinary approach"
    ]
  },
  "resident_feedback_template": "Your performance on this rectal cancer scenario demonstrated [strengths in diagnosis/multidisciplinary approach/technical knowledge]. You correctly [specific positive actions]. Areas for improvement include [specific areas needing improvement]. Consider reviewing the management of locally advanced rectal cancer, particularly regarding [specific knowledge gap]. Recommended reading includes NCCN guidelines for rectal cancer, technical considerations for TME, and indications for neoadjuvant therapy.",
  "learner_feedback_questions": [
    "How realistic was this scenario? (1-5 scale)",
    "How helpful was this scenario in preparing you for the oral boards? (1-5 scale)",
    "Was the difficulty level appropriate? (Too easy / Appropriate / Too difficult)",
    "Were the examiner prompts clear and helpful? (1-5 scale)",
    "What aspects of this scenario were most valuable to your learning?",
    "What suggestions do you have to improve this scenario?",
    "Additional comments or feedback:"
  ]
}