{
  "case_id": "colo_03",
  "title": "Toxic Megacolon in Ulcerative Colitis",
  "diagnosis_topic": "Severe fulminant colitis",
  "tags": [
    "colorectal",
    "ulcerative colitis",
    "toxic megacolon"
  ],
  "setup_script": "A 32-year-old woman with a history of ulcerative colitis presents with severe abdominal pain, distension, fever, and bloody diarrhea. X-ray shows colonic diameter of 7 cm; she is hypotensive and tachycardic.",
  "dynamic_flow": [
    {
      "trigger": "Recognize signs of toxic megacolon: severe colitis, systemic toxicity, colonic dilatation >6 cm.",
      "reply": ""
    },
    {
      "trigger": "Resuscitate with IV fluids, broad-spectrum antibiotics, and bowel rest; monitor electrolytes and hemodynamics.",
      "reply": ""
    },
    {
      "trigger": "Order labs including CBC, CMP, CRP, stool cultures; arrange abdominal X-ray and CT to confirm extent and rule out perforation.",
      "reply": ""
    },
    {
      "trigger": "Consult gastroenterology; start high-dose IV steroids and consider infliximab or cyclosporine if steroid refractory.",
      "reply": ""
    },
    {
      "trigger": "Place nasogastric tube for decompression; position patient to minimize colonic distension; avoid opiates and antidiarrheals.",
      "reply": ""
    },
    {
      "trigger": "Monitor vital signs and abdominal exam closely; repeat abdominal imaging every 6-12 h.",
      "reply": ""
    },
    {
      "trigger": "Identify signs of failure of medical management (continued distension, perforation, sepsis) requiring surgery.",
      "reply": ""
    },
    {
      "trigger": "Discuss surgical options: subtotal colectomy with end ileostomy versus total proctocolectomy; plan subtotal colectomy emergently.",
      "reply": ""
    },
    {
      "trigger": "Obtain informed consent; explain risk of bleeding, infection, and need for future restorative surgery (J-pouch).",
      "reply": ""
    },
    {
      "trigger": "Perform subtotal colectomy with end ileostomy; leave rectal stump for future completion.",
      "reply": ""
    },
    {
      "trigger": "Postoperative management: monitor hemodynamics, fluid balance, stoma function; continue steroids and taper gradually.",
      "reply": ""
    },
    {
      "trigger": "Plan long-term management including staged proctectomy with ileal pouch-anal anastomosis and gastroenterology follow-up.",
      "reply": ""
    }
  ],
  "critical_decision_points": [
    "Early recognition of toxic megacolon and initiation of aggressive medical therapy.",
    "Monitoring for failure of medical therapy and timely decision for surgical intervention.",
    "Performing subtotal colectomy with end ileostomy in unstable patient.",
    "Postoperative care with fluid management and steroid taper.",
    "Planning for staged restorative surgery and coordinating with gastroenterology."
  ],
  "rubric": {
    "domains": {
      "Diagnostic Reasoning": {
        "weight": 0.25,
        "anchors": [
          {
            "score": 1,
            "description": "Fails to consider toxic megacolon or misattributes symptoms to unrelated diagnoses."
          },
          {
            "score": 2,
            "description": "Delayed or incomplete differential diagnosis; overlooks key features of toxic megacolon"
          },
          {
            "score": 3,
            "description": "Recognizes toxic megacolon as a possibility but omits important alternative diagnoses."
          },
          {
            "score": 4,
            "description": "Develops a comprehensive differential including toxic megacolon and systematically rules out other causes."
          },
          {
            "score": 5,
            "description": "Quickly identifies toxic megacolon as the leading diagnosis and articulates a complete differential with supporting and refuting data."
          }
        ]
      },
      "Clinical Judgement": {
        "weight": 0.25,
        "anchors": [
          {
            "score": 1,
            "description": "Fails to recognize patient instability or need for timely intervention."
          },
          {
            "score": 2,
            "description": "Recognizes urgency but delays critical actions or orders inappropriate tests."
          },
          {
            "score": 3,
            "description": "Initiates basic work-up and management but misses key steps or timing."
          },
          {
            "score": 4,
            "description": "Prioritizes resuscitation, diagnostic testing and definitive therapy appropriately with good timing."
          },
          {
            "score": 5,
            "description": "Displays superb judgement by anticipating complications, coordinating multidisciplinary care and making timely decisions."
          }
        ]
      },
      "Communication": {
        "weight": 0.2,
        "anchors": [
          {
            "score": 1,
            "description": "Communication is disorganized, confusing, or lacks empathy toward the patient and team."
          },
          {
            "score": 2,
            "description": "Provides information but lacks clarity, structure or fails to engage patient/team."
          },
          {
            "score": 3,
            "description": "Clear communication of findings and plans but misses opportunities to confirm understanding."
          },
          {
            "score": 4,
            "description": "Communicates clearly, logically and empathetically with patient and interdisciplinary team."
          },
          {
            "score": 5,
            "description": "Exemplary communication: succinct, compassionate and anticipates information needs of patient and team."
          }
        ]
      },
      "Surgical Knowledge": {
        "weight": 0.2,
        "anchors": [
          {
            "score": 1,
            "description": "Lacks understanding of the operative or procedural management for toxic megacolon."
          },
          {
            "score": 2,
            "description": "Identifies operative option for toxic megacolon but with major gaps in technique or indications."
          },
          {
            "score": 3,
            "description": "Describes the key operative steps with minor omissions or uncertainties."
          },
          {
            "score": 4,
            "description": "Completely describes operative management, potential complications and alternatives for toxic megacolon."
          },
          {
            "score": 5,
            "description": "Demonstrates mastery of current evidence, operative nuances and peri-operative considerations for toxic megacolon."
          }
        ]
      },
      "Professionalism": {
        "weight": 0.1,
        "anchors": [
          {
            "score": 1,
            "description": "Displays disrespect, breaches patient confidentiality or fails to recognize limitations."
          },
          {
            "score": 2,
            "description": "Inconsistent respect or lapses in accountability and honesty."
          },
          {
            "score": 3,
            "description": "Maintains respect and integrity but requires prompting for self-reflection."
          },
          {
            "score": 4,
            "description": "Consistently respectful, accountable and receptive to feedback."
          },
          {
            "score": 5,
            "description": "Role model for professionalism, demonstrating humility, cultural sensitivity and ethical behavior."
          }
        ]
      }
    },
    "resident_feedback_template": "This case required prompt identification and treatment of toxic megacolon. Reflect on your decision to transition from medical to surgical management and your explanation of the staged surgical plan."
  }
}