{
  "case_id": "endo_02",
  "title": "Symptomatic Hyperthyroidism Requiring Surgery",
  "diagnosis_topic": "Graves disease refractory to medical therapy",
  "tags": [
    "endocrine",
    "hyperthyroidism",
    "thyroidectomy"
  ],
  "setup_script": "A 30-year-old woman with Graves disease presents with palpitations, weight loss, and ophthalmopathy despite high doses of methimazole and beta-blockers. She desires definitive therapy and is considering thyroidectomy versus radioactive iodine.",
  "dynamic_flow": [
    {
      "trigger": "Review symptoms of thyrotoxicosis and confirm diagnosis with suppressed TSH and elevated free T4/T3.",
      "reply": ""
    },
    {
      "trigger": "Assess for contraindications to radioactive iodine (e.g., pregnancy, ophthalmopathy) and discuss pros/cons of each treatment.",
      "reply": ""
    },
    {
      "trigger": "Explain surgical indications: large goiter, suspicion for cancer, patient preference, or failed medical management.",
      "reply": ""
    },
    {
      "trigger": "Order preoperative evaluation including CBC, CMP, thyroid antibody levels, and laryngoscopy for vocal cord function.",
      "reply": ""
    },
    {
      "trigger": "Ensure patient is euthyroid preoperatively using beta-blockers and possibly iodine or potassium iodide to reduce vascularity.",
      "reply": ""
    },
    {
      "trigger": "Discuss need for total thyroidectomy and potential complications (hypocalcemia, RLN injury, bleeding).",
      "reply": ""
    },
    {
      "trigger": "Plan intraoperative management including nerve monitoring and parathyroid identification.",
      "reply": ""
    },
    {
      "trigger": "Perform total thyroidectomy; note presence of vascular goiter requiring careful dissection.",
      "reply": ""
    },
    {
      "trigger": "Postoperative management: monitor airway, drain output, serum calcium; start levothyroxine replacement.",
      "reply": ""
    },
    {
      "trigger": "Evaluate pathology report; confirm absence of malignancy and completeness of excision.",
      "reply": ""
    },
    {
      "trigger": "Arrange endocrinology follow-up for long-term hormone replacement and adjust dosing.",
      "reply": ""
    },
    {
      "trigger": "Educate patient on recognition of hypocalcemia symptoms and need for lifelong follow-up.",
      "reply": ""
    }
  ],
  "critical_decision_points": [
    "Ensuring patient is euthyroid before surgery to avoid thyroid storm.",
    "Discussing definitive treatment options and respecting patient preference.",
    "Safe dissection with identification and preservation of recurrent laryngeal nerves and parathyroid glands.",
    "Immediate postoperative monitoring of airway and calcium levels.",
    "Appropriate endocrinology referral for lifelong hormone management."
  ],
  "rubric": {
    "domains": {
      "Diagnostic Reasoning": {
        "weight": 0.25,
        "anchors": [
          {
            "score": 1,
            "description": "Fails to consider graves disease thyroidectomy or misattributes symptoms to unrelated diagnoses."
          },
          {
            "score": 2,
            "description": "Delayed or incomplete differential diagnosis; overlooks key features of graves disease thyroidectomy"
          },
          {
            "score": 3,
            "description": "Recognizes graves disease thyroidectomy as a possibility but omits important alternative diagnoses."
          },
          {
            "score": 4,
            "description": "Develops a comprehensive differential including graves disease thyroidectomy and systematically rules out other causes."
          },
          {
            "score": 5,
            "description": "Quickly identifies graves disease thyroidectomy as the leading diagnosis and articulates a complete differential with supporting and refuting data."
          }
        ]
      },
      "Clinical Judgement": {
        "weight": 0.25,
        "anchors": [
          {
            "score": 1,
            "description": "Fails to recognize patient instability or need for timely intervention."
          },
          {
            "score": 2,
            "description": "Recognizes urgency but delays critical actions or orders inappropriate tests."
          },
          {
            "score": 3,
            "description": "Initiates basic work-up and management but misses key steps or timing."
          },
          {
            "score": 4,
            "description": "Prioritizes resuscitation, diagnostic testing and definitive therapy appropriately with good timing."
          },
          {
            "score": 5,
            "description": "Displays superb judgement by anticipating complications, coordinating multidisciplinary care and making timely decisions."
          }
        ]
      },
      "Communication": {
        "weight": 0.2,
        "anchors": [
          {
            "score": 1,
            "description": "Communication is disorganized, confusing, or lacks empathy toward the patient and team."
          },
          {
            "score": 2,
            "description": "Provides information but lacks clarity, structure or fails to engage patient/team."
          },
          {
            "score": 3,
            "description": "Clear communication of findings and plans but misses opportunities to confirm understanding."
          },
          {
            "score": 4,
            "description": "Communicates clearly, logically and empathetically with patient and interdisciplinary team."
          },
          {
            "score": 5,
            "description": "Exemplary communication: succinct, compassionate and anticipates information needs of patient and team."
          }
        ]
      },
      "Surgical Knowledge": {
        "weight": 0.2,
        "anchors": [
          {
            "score": 1,
            "description": "Lacks understanding of the operative or procedural management for graves disease thyroidectomy."
          },
          {
            "score": 2,
            "description": "Identifies operative option for graves disease thyroidectomy but with major gaps in technique or indications."
          },
          {
            "score": 3,
            "description": "Describes the key operative steps with minor omissions or uncertainties."
          },
          {
            "score": 4,
            "description": "Completely describes operative management, potential complications and alternatives for graves disease thyroidectomy."
          },
          {
            "score": 5,
            "description": "Demonstrates mastery of current evidence, operative nuances and peri-operative considerations for graves disease thyroidectomy."
          }
        ]
      },
      "Professionalism": {
        "weight": 0.1,
        "anchors": [
          {
            "score": 1,
            "description": "Displays disrespect, breaches patient confidentiality or fails to recognize limitations."
          },
          {
            "score": 2,
            "description": "Inconsistent respect or lapses in accountability and honesty."
          },
          {
            "score": 3,
            "description": "Maintains respect and integrity but requires prompting for self-reflection."
          },
          {
            "score": 4,
            "description": "Consistently respectful, accountable and receptive to feedback."
          },
          {
            "score": 5,
            "description": "Role model for professionalism, demonstrating humility, cultural sensitivity and ethical behavior."
          }
        ]
      }
    },
    "resident_feedback_template": "This scenario tested your management of hyperthyroidism refractory to medical therapy. We evaluated your ability to counsel on treatment options, ensure preoperative euthyroidism, perform safe thyroidectomy, and plan postoperative care. Reflect on how you balanced patient preference with clinical indications and explained risks of surgery and alternatives."
  }
}