{
  "case_id": "gen_09",
  "title": "Incisional Hernia",
  "diagnosis_topic": "Herniation through a previous surgical incision",
  "tags": [
    "general surgery",
    "hernia",
    "incisional"
  ],
  "setup_script": "A 65-year-old obese woman presents with a bulge at her midline laparotomy incision from a hysterectomy performed 5 years ago. The bulge enlarges when she stands and reduces when she lies down.",
  "dynamic_flow": [
    {
      "trigger": "If resident obtains vital signs",
      "reply": "BP 130/75 mmHg, HR 88 bpm, RR 16/min, Temp 36.8 C."
    },
    {
      "trigger": "If resident performs abdominal exam",
      "reply": "8 cm reducible midline hernia with soft sac; no tenderness or signs of incarceration."
    },
    {
      "trigger": "If resident orders CT scan of the abdomen",
      "reply": "Fascial defect measuring 5 cm with protrusion of preperitoneal fat; no bowel obstruction."
    },
    {
      "trigger": "If resident discusses risk factors",
      "reply": "Obesity, smoking, chronic cough, wound infection and poor nutrition contribute to incisional hernia formation."
    },
    {
      "trigger": "If resident recommends elective repair",
      "reply": "Consider open or laparoscopic ventral hernia repair with mesh placement; preoperative weight loss and smoking cessation advised."
    },
    {
      "trigger": "If resident delays repair",
      "reply": "Risk of incarceration increases; hernia may enlarge making repair more complex."
    },
    {
      "trigger": "If patient has minimal symptoms and significant comorbidities",
      "reply": "Watchful waiting may be acceptable with education on warning signs."
    },
    {
      "trigger": "If resident describes surgical techniques",
      "reply": "Open component separation or minimally invasive laparoscopic/robotic repair; choice depends on defect size and surgeon expertise."
    },
    {
      "trigger": "If resident outlines postoperative precautions",
      "reply": "Avoid heavy lifting for 6-8 weeks, wear abdominal binder and manage pain."
    },
    {
      "trigger": "If resident addresses recurrence risk",
      "reply": "Recurrence rates lower with mesh; careful closure and tension-free repair improve outcomes."
    },
    {
      "trigger": "If resident discusses prevention in future surgeries",
      "reply": "Use prophylactic mesh in high-risk patients and optimize perioperative factors like glycemic control."
    },
    {
      "trigger": "If resident educates patient",
      "reply": "Recognize signs of strangulation and seek prompt evaluation if pain or incarceration develops."
    }
  ],
  "critical_decision_points": [
    "Assessment of incisional hernia size and reducibility via exam and imaging",
    "Risk factor modification prior to elective repair",
    "Decision-making between elective repair and watchful waiting",
    "Selection of operative technique and mesh use",
    "Postoperative care, recurrence prevention and patient education"
  ],
  "rubric": {
    "domains": {
      "Diagnostic Reasoning": {
        "weight": 0.25,
        "anchors": [
          {
            "score": 1,
            "description": "Fails to consider incisional hernia or misattributes symptoms to unrelated diagnoses."
          },
          {
            "score": 2,
            "description": "Delayed or incomplete differential diagnosis; overlooks key features of incisional hernia"
          },
          {
            "score": 3,
            "description": "Recognizes incisional hernia as a possibility but omits important alternative diagnoses."
          },
          {
            "score": 4,
            "description": "Develops a comprehensive differential including incisional hernia and systematically rules out other causes."
          },
          {
            "score": 5,
            "description": "Quickly identifies incisional hernia as the leading diagnosis and articulates a complete differential with supporting and refuting data."
          }
        ]
      },
      "Clinical Judgement": {
        "weight": 0.25,
        "anchors": [
          {
            "score": 1,
            "description": "Fails to recognize patient instability or need for timely intervention."
          },
          {
            "score": 2,
            "description": "Recognizes urgency but delays critical actions or orders inappropriate tests."
          },
          {
            "score": 3,
            "description": "Initiates basic work-up and management but misses key steps or timing."
          },
          {
            "score": 4,
            "description": "Prioritizes resuscitation, diagnostic testing and definitive therapy appropriately with good timing."
          },
          {
            "score": 5,
            "description": "Displays superb judgement by anticipating complications, coordinating multidisciplinary care and making timely decisions."
          }
        ]
      },
      "Communication": {
        "weight": 0.2,
        "anchors": [
          {
            "score": 1,
            "description": "Communication is disorganized, confusing, or lacks empathy toward the patient and team."
          },
          {
            "score": 2,
            "description": "Provides information but lacks clarity, structure or fails to engage patient/team."
          },
          {
            "score": 3,
            "description": "Clear communication of findings and plans but misses opportunities to confirm understanding."
          },
          {
            "score": 4,
            "description": "Communicates clearly, logically and empathetically with patient and interdisciplinary team."
          },
          {
            "score": 5,
            "description": "Exemplary communication: succinct, compassionate and anticipates information needs of patient and team."
          }
        ]
      },
      "Surgical Knowledge": {
        "weight": 0.2,
        "anchors": [
          {
            "score": 1,
            "description": "Lacks understanding of the operative or procedural management for incisional hernia."
          },
          {
            "score": 2,
            "description": "Identifies operative option for incisional hernia but with major gaps in technique or indications."
          },
          {
            "score": 3,
            "description": "Describes the key operative steps with minor omissions or uncertainties."
          },
          {
            "score": 4,
            "description": "Completely describes operative management, potential complications and alternatives for incisional hernia."
          },
          {
            "score": 5,
            "description": "Demonstrates mastery of current evidence, operative nuances and peri-operative considerations for incisional hernia."
          }
        ]
      },
      "Professionalism": {
        "weight": 0.1,
        "anchors": [
          {
            "score": 1,
            "description": "Displays disrespect, breaches patient confidentiality or fails to recognize limitations."
          },
          {
            "score": 2,
            "description": "Inconsistent respect or lapses in accountability and honesty."
          },
          {
            "score": 3,
            "description": "Maintains respect and integrity but requires prompting for self-reflection."
          },
          {
            "score": 4,
            "description": "Consistently respectful, accountable and receptive to feedback."
          },
          {
            "score": 5,
            "description": "Role model for professionalism, demonstrating humility, cultural sensitivity and ethical behavior."
          }
        ]
      }
    },
    "resident_feedback_template": "You provided a comprehensive plan for incisional hernia repair. Improve by discussing prophylactic measures during initial surgeries and individualized decision-making for high-risk patients."
  }
}