{
  "case_id": "hepato_03",
  "title": "Gallstone Pancreatitis",
  "diagnosis_topic": "Acute pancreatitis triggered by transient obstruction of the common bile duct by gallstones",
  "tags": [
    "hepatobiliary",
    "pancreatitis",
    "gallstones"
  ],
  "setup_script": "A 40-year-old woman presents with sudden onset of epigastric pain radiating to the back accompanied by nausea and vomiting. She has a history of gallstones.",
  "dynamic_flow": [
    {
      "trigger": "If resident obtains vital signs",
      "reply": "BP 110/70 mmHg, HR 105 bpm, RR 20/min, Temp 37.9 C."
    },
    {
      "trigger": "If resident performs abdominal exam",
      "reply": "Epigastric tenderness without rebound; no jaundice initially."
    },
    {
      "trigger": "If resident orders labs",
      "reply": "Serum lipase 800 U/L (elevated), AST/ALT moderately elevated; bilirubin 2 mg/dL indicating biliary obstruction."
    },
    {
      "trigger": "If resident obtains ultrasound",
      "reply": "Gallstones in gallbladder; common bile duct slightly dilated but no stones visualized."
    },
    {
      "trigger": "If resident initiates aggressive IV hydration and analgesia",
      "reply": "Lactated Ringer's infusion started; pain managed with opioids."
    },
    {
      "trigger": "If resident keeps patient NPO",
      "reply": "Prevents pancreatic stimulation; NG tube if vomiting persists."
    },
    {
      "trigger": "If resident consults GI for ERCP",
      "reply": "Indicated if cholangitis or persistent common bile duct obstruction; otherwise not urgently needed."
    },
    {
      "trigger": "If resident delays cholecystectomy until after pancreatitis resolves",
      "reply": "Early laparoscopic cholecystectomy during index hospitalization reduces recurrence."
    },
    {
      "trigger": "If resident monitors for complications",
      "reply": "Watch for necrotizing pancreatitis, pseudocysts and systemic inflammatory response syndrome."
    },
    {
      "trigger": "If resident prescribes antibiotics empirically",
      "reply": "Not indicated unless infection or cholangitis present."
    },
    {
      "trigger": "If resident discusses scoring systems",
      "reply": "Ranson or BISAP scores help stratify severity and guide ICU admission."
    },
    {
      "trigger": "If resident provides dietary counseling",
      "reply": "Low-fat diet after recovery and avoidance of alcohol."
    }
  ],
  "critical_decision_points": [
    "Diagnosis of gallstone pancreatitis with elevated lipase and ultrasound",
    "Early fluid resuscitation and pain control",
    "Determination of need for ERCP and timing of cholecystectomy",
    "Monitoring for complications and avoiding unnecessary antibiotics",
    "Patient education on diet and recurrence prevention"
  ],
  "rubric": {
    "domains": {
      "Diagnostic Reasoning": {
        "weight": 0.25,
        "anchors": [
          {
            "score": 1,
            "description": "Fails to consider gallstone pancreatitis or misattributes symptoms to unrelated diagnoses."
          },
          {
            "score": 2,
            "description": "Delayed or incomplete differential diagnosis; overlooks key features of gallstone pancreatitis"
          },
          {
            "score": 3,
            "description": "Recognizes gallstone pancreatitis as a possibility but omits important alternative diagnoses."
          },
          {
            "score": 4,
            "description": "Develops a comprehensive differential including gallstone pancreatitis and systematically rules out other causes."
          },
          {
            "score": 5,
            "description": "Quickly identifies gallstone pancreatitis as the leading diagnosis and articulates a complete differential with supporting and refuting data."
          }
        ]
      },
      "Clinical Judgement": {
        "weight": 0.25,
        "anchors": [
          {
            "score": 1,
            "description": "Fails to recognize patient instability or need for timely intervention."
          },
          {
            "score": 2,
            "description": "Recognizes urgency but delays critical actions or orders inappropriate tests."
          },
          {
            "score": 3,
            "description": "Initiates basic work-up and management but misses key steps or timing."
          },
          {
            "score": 4,
            "description": "Prioritizes resuscitation, diagnostic testing and definitive therapy appropriately with good timing."
          },
          {
            "score": 5,
            "description": "Displays superb judgement by anticipating complications, coordinating multidisciplinary care and making timely decisions."
          }
        ]
      },
      "Communication": {
        "weight": 0.2,
        "anchors": [
          {
            "score": 1,
            "description": "Communication is disorganized, confusing, or lacks empathy toward the patient and team."
          },
          {
            "score": 2,
            "description": "Provides information but lacks clarity, structure or fails to engage patient/team."
          },
          {
            "score": 3,
            "description": "Clear communication of findings and plans but misses opportunities to confirm understanding."
          },
          {
            "score": 4,
            "description": "Communicates clearly, logically and empathetically with patient and interdisciplinary team."
          },
          {
            "score": 5,
            "description": "Exemplary communication: succinct, compassionate and anticipates information needs of patient and team."
          }
        ]
      },
      "Surgical Knowledge": {
        "weight": 0.2,
        "anchors": [
          {
            "score": 1,
            "description": "Lacks understanding of the operative or procedural management for gallstone pancreatitis."
          },
          {
            "score": 2,
            "description": "Identifies operative option for gallstone pancreatitis but with major gaps in technique or indications."
          },
          {
            "score": 3,
            "description": "Describes the key operative steps with minor omissions or uncertainties."
          },
          {
            "score": 4,
            "description": "Completely describes operative management, potential complications and alternatives for gallstone pancreatitis."
          },
          {
            "score": 5,
            "description": "Demonstrates mastery of current evidence, operative nuances and peri-operative considerations for gallstone pancreatitis."
          }
        ]
      },
      "Professionalism": {
        "weight": 0.1,
        "anchors": [
          {
            "score": 1,
            "description": "Displays disrespect, breaches patient confidentiality or fails to recognize limitations."
          },
          {
            "score": 2,
            "description": "Inconsistent respect or lapses in accountability and honesty."
          },
          {
            "score": 3,
            "description": "Maintains respect and integrity but requires prompting for self-reflection."
          },
          {
            "score": 4,
            "description": "Consistently respectful, accountable and receptive to feedback."
          },
          {
            "score": 5,
            "description": "Role model for professionalism, demonstrating humility, cultural sensitivity and ethical behavior."
          }
        ]
      }
    },
    "resident_feedback_template": "You managed gallstone pancreatitis with appropriate resuscitation. Work on clarifying indications for ERCP and early cholecystectomy timing."
  }
}