{
  "case_id": "ped_05",
  "title": "Congenital Diaphragmatic Hernia",
  "diagnosis_topic": "Neonatal diaphragmatic defect causing pulmonary hypoplasia and respiratory distress",
  "tags": [
    "pediatric",
    "congenital",
    "diaphragmatic hernia"
  ],
  "setup_script": "A full-term newborn develops severe respiratory distress immediately after birth. The abdomen appears scaphoid and bowel sounds are heard in the chest. The infant was delivered after an uncomplicated pregnancy.",
  "dynamic_flow": [
    {
      "trigger": "If resident assesses vital signs",
      "reply": "HR 170 bpm, RR 60/min, SpO2 80% on blow-by oxygen; baby cyanotic."
    },
    {
      "trigger": "If resident evaluates physical exam",
      "reply": "Barrel-shaped chest, scaphoid abdomen, decreased breath sounds on left; heart sounds shifted to the right."
    },
    {
      "trigger": "If resident obtains chest X-ray",
      "reply": "Loops of bowel in the left hemithorax with mediastinal shift; no clear diaphragmatic dome."
    },
    {
      "trigger": "If resident immediately intubates and avoids bag-mask ventilation",
      "reply": "Prevents insufflation of stomach into chest; NG tube placed for decompression."
    },
    {
      "trigger": "If resident starts gentle ventilation with permissive hypercapnia",
      "reply": "Avoids barotrauma to hypoplastic lungs."
    },
    {
      "trigger": "If resident obtains arterial blood gas",
      "reply": "Shows respiratory acidosis and hypoxemia; adjust ventilator settings accordingly."
    },
    {
      "trigger": "If resident evaluates for associated anomalies",
      "reply": "Echocardiogram to assess pulmonary hypertension and structural heart disease."
    },
    {
      "trigger": "If resident consults pediatric surgery",
      "reply": "Surgical repair delayed until stabilization of pulmonary hypertension, typically within first week."
    },
    {
      "trigger": "If patient deteriorates despite maximal ventilatory support",
      "reply": "Consider extracorporeal membrane oxygenation (ECMO) as a bridge to surgery."
    },
    {
      "trigger": "If resident delays intubation and uses bag-mask",
      "reply": "Stomach distends, worsening respiratory compromise."
    },
    {
      "trigger": "If resident discusses postoperative care",
      "reply": "Prolonged ventilatory support, management of pulmonary hypertension and feeding intolerance."
    },
    {
      "trigger": "If resident counsels parents",
      "reply": "Explain long-term outcomes including chronic lung disease, gastroesophageal reflux and developmental delays."
    }
  ],
  "critical_decision_points": [
    "Immediate airway management and avoidance of bag-mask ventilation",
    "Diagnosis via chest X-ray and physical signs",
    "Stabilization of pulmonary hypertension prior to surgical repair",
    "Consideration of ECMO for refractory respiratory failure",
    "Comprehensive parental counseling and long-term follow-up"
  ],
  "rubric": {
    "domains": {
      "Diagnostic Reasoning": {
        "weight": 0.25,
        "anchors": [
          {
            "score": 1,
            "description": "Fails to consider congenital diaphragmatic hernia or misattributes symptoms to unrelated diagnoses."
          },
          {
            "score": 2,
            "description": "Delayed or incomplete differential diagnosis; overlooks key features of congenital diaphragmatic hernia"
          },
          {
            "score": 3,
            "description": "Recognizes congenital diaphragmatic hernia as a possibility but omits important alternative diagnoses."
          },
          {
            "score": 4,
            "description": "Develops a comprehensive differential including congenital diaphragmatic hernia and systematically rules out other causes."
          },
          {
            "score": 5,
            "description": "Quickly identifies congenital diaphragmatic hernia as the leading diagnosis and articulates a complete differential with supporting and refuting data."
          }
        ]
      },
      "Clinical Judgement": {
        "weight": 0.25,
        "anchors": [
          {
            "score": 1,
            "description": "Fails to recognize patient instability or need for timely intervention."
          },
          {
            "score": 2,
            "description": "Recognizes urgency but delays critical actions or orders inappropriate tests."
          },
          {
            "score": 3,
            "description": "Initiates basic work-up and management but misses key steps or timing."
          },
          {
            "score": 4,
            "description": "Prioritizes resuscitation, diagnostic testing and definitive therapy appropriately with good timing."
          },
          {
            "score": 5,
            "description": "Displays superb judgement by anticipating complications, coordinating multidisciplinary care and making timely decisions."
          }
        ]
      },
      "Communication": {
        "weight": 0.2,
        "anchors": [
          {
            "score": 1,
            "description": "Communication is disorganized, confusing, or lacks empathy toward the patient and team."
          },
          {
            "score": 2,
            "description": "Provides information but lacks clarity, structure or fails to engage patient/team."
          },
          {
            "score": 3,
            "description": "Clear communication of findings and plans but misses opportunities to confirm understanding."
          },
          {
            "score": 4,
            "description": "Communicates clearly, logically and empathetically with patient and interdisciplinary team."
          },
          {
            "score": 5,
            "description": "Exemplary communication: succinct, compassionate and anticipates information needs of patient and team."
          }
        ]
      },
      "Surgical Knowledge": {
        "weight": 0.2,
        "anchors": [
          {
            "score": 1,
            "description": "Lacks understanding of the operative or procedural management for congenital diaphragmatic hernia."
          },
          {
            "score": 2,
            "description": "Identifies operative option for congenital diaphragmatic hernia but with major gaps in technique or indications."
          },
          {
            "score": 3,
            "description": "Describes the key operative steps with minor omissions or uncertainties."
          },
          {
            "score": 4,
            "description": "Completely describes operative management, potential complications and alternatives for congenital diaphragmatic hernia."
          },
          {
            "score": 5,
            "description": "Demonstrates mastery of current evidence, operative nuances and peri-operative considerations for congenital diaphragmatic hernia."
          }
        ]
      },
      "Professionalism": {
        "weight": 0.1,
        "anchors": [
          {
            "score": 1,
            "description": "Displays disrespect, breaches patient confidentiality or fails to recognize limitations."
          },
          {
            "score": 2,
            "description": "Inconsistent respect or lapses in accountability and honesty."
          },
          {
            "score": 3,
            "description": "Maintains respect and integrity but requires prompting for self-reflection."
          },
          {
            "score": 4,
            "description": "Consistently respectful, accountable and receptive to feedback."
          },
          {
            "score": 5,
            "description": "Role model for professionalism, demonstrating humility, cultural sensitivity and ethical behavior."
          }
        ]
      }
    },
    "resident_feedback_template": "You managed the congenital diaphragmatic hernia with appropriate airway control and stabilization. Enhance your performance by articulating the timing of surgery and postoperative challenges such as pulmonary hypertension."
  }
}