{
  "case_id": "scenario_3_deteriorating_abdominal_sepsis",
  "title": "Scenario 3: Surgical Critical Care",
  "diagnosis_topic": "Deteriorating Patient with Abdominal Sepsis",
  "setup_script": "You are called to the ICU to see a 68-year-old male with a history of hypertension, COPD, and known diverticulosis who was admitted 12 hours ago with abdominal pain. Despite IV antibiotics and fluid resuscitation, he has deteriorated. Current vital signs: Temperature 39.2°C, HR 128, BP 75/40, RR 28, O2 saturation 91% on 2L nasal cannula. Physical exam shows diffuse abdominal tenderness with involuntary guarding and rebound, worse in the left lower quadrant. Lab results show: WBC 22,000/μL, Hgb 10.5 g/dL, lactate 5.6 mmol/L, creatinine 2.1 mg/dL (baseline 1.0). Recent CT scan shows perforated sigmoid diverticulitis with free air and fluid collections in the pelvis. How would you manage this patient?",
  "dynamic_flow": [
    {
      "trigger": "If resident prioritizes hemodynamic stabilization",
      "reply": "After 2L of crystalloid, the patient remains hypotensive with BP 80/45. How will you proceed?"
    },
    {
      "trigger": "If resident initiates vasopressors",
      "reply": "You start norepinephrine. The BP improves to 90/55. What's your next step in management?"
    },
    {
      "trigger": "If resident doesn't mention immediate surgical intervention",
      "reply": "The patient continues to deteriorate despite medical management. What definitive treatment does this patient need?"
    },
    {
      "trigger": "If resident prepares for surgery",
      "reply": "What is your specific operative plan for this patient with perforated diverticulitis and septic shock?"
    },
    {
      "trigger": "If resident suggests Hartmann's procedure",
      "reply": "During surgery, you find diffuse fecal peritonitis, a 2cm perforation in the sigmoid colon with surrounding inflammation and induration. How will you complete the operation?"
    },
    {
      "trigger": "If resident doesn't mention damage control approach",
      "reply": "The patient is becoming increasingly unstable on the operating table with worsening acidosis (pH 7.15) and hypothermia (temperature 35.2°C). How does this change your operative approach?"
    },
    {
      "trigger": "If resident describes damage control surgery",
      "reply": "You perform a Hartmann's procedure with end colostomy, leave the abdomen open with a temporary closure device, and transfer the patient to the ICU. What specific postoperative ICU management will you order?"
    },
    {
      "trigger": "If resident doesn't address source control adequately",
      "reply": "The patient remains febrile and vasopressor-dependent 48 hours postoperatively. What concerns do you have and what would you do next?"
    }
  ],
  "critical_decision_points": [
    "Recognition and management of septic shock",
    "Appropriate fluid resuscitation and vasopressor initiation",
    "Decision for emergency surgical intervention",
    "Choice of appropriate surgical procedure (Hartmann's vs. primary anastomosis)",
    "Recognition of need for damage control surgery in unstable patient",
    "Postoperative critical care management",
    "Recognition and management of ongoing sepsis",
    "ICU management including ventilator settings, nutrition, and renal support if needed"
  ],
  "rubric": {
    "diagnostic_reasoning": [
      "Does not recognize septic shock or link to perforated diverticulitis",
      "Delayed recognition of severity of septic shock or source",
      "Recognizes septic shock and perforated diverticulitis as source",
      "Promptly identifies septic shock, understands pathophysiology, and correctly interprets all clinical data",
      "Excellent diagnostic approach with comprehensive differential diagnosis, precise interpretation of hemodynamic parameters, and recognition of organ dysfunction"
    ],
    "clinical_judgment": [
      "Inappropriate or dangerously delayed management of septic shock",
      "Suboptimal resuscitation, delayed surgical intervention",
      "Appropriate initial resuscitation and recognition of need for surgical intervention",
      "Good clinical judgment in sepsis management, appropriate prioritization of interventions",
      "Excellent clinical judgment throughout with proper sequencing of resuscitation, source control, and ongoing management; anticipates complications"
    ],
    "communication": [
      "Disorganized presentation, unable to articulate management priorities",
      "Somewhat organized but incomplete information on management plan",
      "Clear communication of sepsis management and surgical plan",
      "Well-organized, systematic presentation of assessment and plan with clear rationale",
      "Exceptionally clear communication, excellent organization, articulates complex decision-making and multidisciplinary approach"
    ],
    "surgical_knowledge": [
      "Inadequate knowledge of management of perforated diverticulitis",
      "Basic understanding of surgical options but limited knowledge of critical care principles",
      "Adequate knowledge of surgical approach and critical care management",
      "Good knowledge of surgical options, damage control principles, and ICU management",
      "Excellent knowledge of surgical decision-making in unstable patients, damage control techniques, and comprehensive ICU management including ventilator strategies and renal support"
    ],
    "professionalism": [
      "Does not involve critical care team appropriately",
      "Minimal collaboration with ICU team, defensive when questioned",
      "Appropriate collaboration and communication with ICU team",
      "Good leadership in critical care setting, effective communication with entire team",
      "Excellent team leadership, clear delegation, appropriate consultation with critical care specialists, and emphasis on patient-centered care"
    ]
  },
  "resident_feedback_template": "Your performance on this septic shock scenario demonstrated [strengths in resuscitation/surgical decision-making/critical care management]. You correctly [specific positive actions]. Areas for improvement include [specific areas needing improvement]. Consider reviewing the management of septic shock and perforated diverticulitis, particularly regarding [specific knowledge gap]. Recommended reading includes the Surviving Sepsis Campaign guidelines, damage control surgery principles, and management options for complicated diverticulitis.",
  "learner_feedback_questions": [
    "How realistic was this scenario? (1-5 scale)",
    "How helpful was this scenario in preparing you for the oral boards? (1-5 scale)",
    "Was the difficulty level appropriate? (Too easy / Appropriate / Too difficult)",
    "Were the examiner prompts clear and helpful? (1-5 scale)",
    "What aspects of this scenario were most valuable to your learning?",
    "What suggestions do you have to improve this scenario?",
    "Additional comments or feedback:"
  ]
}