{
  "case_id": "sst_02",
  "title": "Skin Abscess",
  "diagnosis_topic": "Localized soft tissue infection with purulent collection",
  "tags": [
    "skin",
    "abscess",
    "infection"
  ],
  "setup_script": "A 35-year-old woman presents with a painful, red lump on her right thigh that has enlarged over the past week. She has a low-grade fever and no significant medical history.",
  "dynamic_flow": [
    {
      "trigger": "If resident obtains vital signs",
      "reply": "BP 118/72 mmHg, HR 88 bpm, RR 16/min, Temp 37.8 C."
    },
    {
      "trigger": "If resident inspects the lesion",
      "reply": "4 cm erythematous, fluctuant mass with central punctum; surrounding cellulitis present."
    },
    {
      "trigger": "If resident orders labs",
      "reply": "Not routinely necessary but CBC shows WBC 12 K/uL."
    },
    {
      "trigger": "If resident incises and drains the abscess under local anesthesia",
      "reply": "Thick purulent material evacuated; wound irrigated."
    },
    {
      "trigger": "If resident sends wound culture",
      "reply": "Culture obtained to guide antibiotic therapy if risk factors present."
    },
    {
      "trigger": "If resident prescribes antibiotics",
      "reply": "Not needed for small abscesses in healthy individuals; consider trimethoprim-sulfamethoxazole for MRSA coverage if systemic symptoms or surrounding cellulitis."
    },
    {
      "trigger": "If resident neglects to perform I&D",
      "reply": "Abscess may rupture spontaneously and spread infection."
    },
    {
      "trigger": "If resident asks about risk factors for MRSA",
      "reply": "Recent hospitalization, IV drug use, close contact outbreaks."
    },
    {
      "trigger": "If resident advises warm compresses and wound care",
      "reply": "Promotes drainage and healing."
    },
    {
      "trigger": "If resident discusses packing versus loose closure",
      "reply": "Small cavity may be left open without packing; larger cavities may be loosely packed to prevent premature closure."
    },
    {
      "trigger": "If resident assesses for underlying diabetes or immunosuppression",
      "reply": "Screening blood glucose performed."
    },
    {
      "trigger": "If resident arranges follow-up",
      "reply": "Reevaluate in 2-3 days for persistent infection or need for further debridement."
    }
  ],
  "critical_decision_points": [
    "Diagnosis and physical exam of a skin abscess",
    "Appropriate use of incision and drainage as primary therapy",
    "Judicious use of antibiotics based on risk factors",
    "Identification of MRSA risk and patient counseling",
    "Wound care instructions and follow-up to ensure resolution"
  ],
  "rubric": {
    "domains": {
      "Diagnostic Reasoning": {
        "weight": 0.25,
        "anchors": [
          {
            "score": 1,
            "description": "Fails to consider skin abscess or misattributes symptoms to unrelated diagnoses."
          },
          {
            "score": 2,
            "description": "Delayed or incomplete differential diagnosis; overlooks key features of skin abscess"
          },
          {
            "score": 3,
            "description": "Recognizes skin abscess as a possibility but omits important alternative diagnoses."
          },
          {
            "score": 4,
            "description": "Develops a comprehensive differential including skin abscess and systematically rules out other causes."
          },
          {
            "score": 5,
            "description": "Quickly identifies skin abscess as the leading diagnosis and articulates a complete differential with supporting and refuting data."
          }
        ]
      },
      "Clinical Judgement": {
        "weight": 0.25,
        "anchors": [
          {
            "score": 1,
            "description": "Fails to recognize patient instability or need for timely intervention."
          },
          {
            "score": 2,
            "description": "Recognizes urgency but delays critical actions or orders inappropriate tests."
          },
          {
            "score": 3,
            "description": "Initiates basic work-up and management but misses key steps or timing."
          },
          {
            "score": 4,
            "description": "Prioritizes resuscitation, diagnostic testing and definitive therapy appropriately with good timing."
          },
          {
            "score": 5,
            "description": "Displays superb judgement by anticipating complications, coordinating multidisciplinary care and making timely decisions."
          }
        ]
      },
      "Communication": {
        "weight": 0.2,
        "anchors": [
          {
            "score": 1,
            "description": "Communication is disorganized, confusing, or lacks empathy toward the patient and team."
          },
          {
            "score": 2,
            "description": "Provides information but lacks clarity, structure or fails to engage patient/team."
          },
          {
            "score": 3,
            "description": "Clear communication of findings and plans but misses opportunities to confirm understanding."
          },
          {
            "score": 4,
            "description": "Communicates clearly, logically and empathetically with patient and interdisciplinary team."
          },
          {
            "score": 5,
            "description": "Exemplary communication: succinct, compassionate and anticipates information needs of patient and team."
          }
        ]
      },
      "Surgical Knowledge": {
        "weight": 0.2,
        "anchors": [
          {
            "score": 1,
            "description": "Lacks understanding of the operative or procedural management for skin abscess."
          },
          {
            "score": 2,
            "description": "Identifies operative option for skin abscess but with major gaps in technique or indications."
          },
          {
            "score": 3,
            "description": "Describes the key operative steps with minor omissions or uncertainties."
          },
          {
            "score": 4,
            "description": "Completely describes operative management, potential complications and alternatives for skin abscess."
          },
          {
            "score": 5,
            "description": "Demonstrates mastery of current evidence, operative nuances and peri-operative considerations for skin abscess."
          }
        ]
      },
      "Professionalism": {
        "weight": 0.1,
        "anchors": [
          {
            "score": 1,
            "description": "Displays disrespect, breaches patient confidentiality or fails to recognize limitations."
          },
          {
            "score": 2,
            "description": "Inconsistent respect or lapses in accountability and honesty."
          },
          {
            "score": 3,
            "description": "Maintains respect and integrity but requires prompting for self-reflection."
          },
          {
            "score": 4,
            "description": "Consistently respectful, accountable and receptive to feedback."
          },
          {
            "score": 5,
            "description": "Role model for professionalism, demonstrating humility, cultural sensitivity and ethical behavior."
          }
        ]
      }
    },
    "resident_feedback_template": "Your management of the skin abscess was effective with proper I&D. Areas for improvement include refining indications for adjunctive antibiotics and educating patients about wound care."
  }
}