{
  "case_id": "sst_01",
  "title": "Necrotizing Fasciitis of the Lower Extremity",
  "diagnosis_topic": "Rapidly progressive soft tissue infection with fascial necrosis",
  "tags": [
    "skin",
    "soft tissue",
    "infection",
    "necrotizing fasciitis"
  ],
  "setup_script": "A 55-year-old man with poorly controlled diabetes presents with severe pain and swelling in his left calf. The pain began yesterday and has worsened rapidly. He reports malaise and fever.",
  "dynamic_flow": [
    {
      "trigger": "If resident obtains vital signs",
      "reply": "BP 100/60 mmHg, HR 115 bpm, RR 24/min, Temp 38.9 C, SpO2 98%."
    },
    {
      "trigger": "If resident examines the leg",
      "reply": "Diffuse erythema with edema, bullae formation and areas of dusky discoloration; tenderness out of proportion to appearance; crepitus palpable."
    },
    {
      "trigger": "If resident orders labs",
      "reply": "WBC 22 K/uL, creatinine 1.6 mg/dL, lactate 4.5 mmol/L, CRP markedly elevated."
    },
    {
      "trigger": "If resident obtains imaging",
      "reply": "Plain X-ray shows subcutaneous gas; CT confirms fascial thickening and gas tracking along fascia."
    },
    {
      "trigger": "If resident initiates broad-spectrum antibiotics (carbapenem plus clindamycin)",
      "reply": "Therapy started immediately."
    },
    {
      "trigger": "If resident consults surgery for emergent debridement",
      "reply": "Patient taken to OR for aggressive debridement of necrotic tissue."
    },
    {
      "trigger": "If resident delays operative intervention",
      "reply": "Patient develops septic shock and multiorgan failure."
    },
    {
      "trigger": "If resident asks about risk factors",
      "reply": "Diabetes, immunosuppression, recent surgery, trauma and peripheral vascular disease."
    },
    {
      "trigger": "If resident discusses early signs vs. late findings",
      "reply": "Early pain out of proportion and erythema; late skin anesthesia, bullae, necrosis and systemic toxicity."
    },
    {
      "trigger": "If resident provides hemodynamic support",
      "reply": "IV fluids and vasopressors as needed; monitor urine output."
    },
    {
      "trigger": "If resident anticipates need for repeat debridements",
      "reply": "Multiple returns to OR often necessary until healthy bleeding tissue encountered."
    },
    {
      "trigger": "If resident addresses adjunct therapies",
      "reply": "Hyperbaric oxygen and IV immunoglobulin have limited evidence but may be considered."
    }
  ],
  "critical_decision_points": [
    "Early recognition of necrotizing infection with pain out of proportion to exam",
    "Prompt initiation of broad-spectrum antibiotics and hemodynamic support",
    "Urgent surgical consultation and aggressive debridement without delay",
    "Identification of risk factors and typical early and late clinical signs",
    "Planning for repeat debridement and postoperative critical care"
  ],
  "rubric": {
    "domains": {
      "Diagnostic Reasoning": {
        "weight": 0.25,
        "anchors": [
          {
            "score": 1,
            "description": "Fails to consider necrotizing fasciitis or misattributes symptoms to unrelated diagnoses."
          },
          {
            "score": 2,
            "description": "Delayed or incomplete differential diagnosis; overlooks key features of necrotizing fasciitis"
          },
          {
            "score": 3,
            "description": "Recognizes necrotizing fasciitis as a possibility but omits important alternative diagnoses."
          },
          {
            "score": 4,
            "description": "Develops a comprehensive differential including necrotizing fasciitis and systematically rules out other causes."
          },
          {
            "score": 5,
            "description": "Quickly identifies necrotizing fasciitis as the leading diagnosis and articulates a complete differential with supporting and refuting data."
          }
        ]
      },
      "Clinical Judgement": {
        "weight": 0.25,
        "anchors": [
          {
            "score": 1,
            "description": "Fails to recognize patient instability or need for timely intervention."
          },
          {
            "score": 2,
            "description": "Recognizes urgency but delays critical actions or orders inappropriate tests."
          },
          {
            "score": 3,
            "description": "Initiates basic work-up and management but misses key steps or timing."
          },
          {
            "score": 4,
            "description": "Prioritizes resuscitation, diagnostic testing and definitive therapy appropriately with good timing."
          },
          {
            "score": 5,
            "description": "Displays superb judgement by anticipating complications, coordinating multidisciplinary care and making timely decisions."
          }
        ]
      },
      "Communication": {
        "weight": 0.2,
        "anchors": [
          {
            "score": 1,
            "description": "Communication is disorganized, confusing, or lacks empathy toward the patient and team."
          },
          {
            "score": 2,
            "description": "Provides information but lacks clarity, structure or fails to engage patient/team."
          },
          {
            "score": 3,
            "description": "Clear communication of findings and plans but misses opportunities to confirm understanding."
          },
          {
            "score": 4,
            "description": "Communicates clearly, logically and empathetically with patient and interdisciplinary team."
          },
          {
            "score": 5,
            "description": "Exemplary communication: succinct, compassionate and anticipates information needs of patient and team."
          }
        ]
      },
      "Surgical Knowledge": {
        "weight": 0.2,
        "anchors": [
          {
            "score": 1,
            "description": "Lacks understanding of the operative or procedural management for necrotizing fasciitis."
          },
          {
            "score": 2,
            "description": "Identifies operative option for necrotizing fasciitis but with major gaps in technique or indications."
          },
          {
            "score": 3,
            "description": "Describes the key operative steps with minor omissions or uncertainties."
          },
          {
            "score": 4,
            "description": "Completely describes operative management, potential complications and alternatives for necrotizing fasciitis."
          },
          {
            "score": 5,
            "description": "Demonstrates mastery of current evidence, operative nuances and peri-operative considerations for necrotizing fasciitis."
          }
        ]
      },
      "Professionalism": {
        "weight": 0.1,
        "anchors": [
          {
            "score": 1,
            "description": "Displays disrespect, breaches patient confidentiality or fails to recognize limitations."
          },
          {
            "score": 2,
            "description": "Inconsistent respect or lapses in accountability and honesty."
          },
          {
            "score": 3,
            "description": "Maintains respect and integrity but requires prompting for self-reflection."
          },
          {
            "score": 4,
            "description": "Consistently respectful, accountable and receptive to feedback."
          },
          {
            "score": 5,
            "description": "Role model for professionalism, demonstrating humility, cultural sensitivity and ethical behavior."
          }
        ]
      }
    },
    "resident_feedback_template": "You recognized the signs of necrotizing fasciitis and prioritized surgical debridement. Continue to work on swift escalation of care and counseling the team about the seriousness of this infection."
  }
}