{
  "case_id": "trauma_07",
  "title": "Cardiac Tamponade from Penetrating Trauma",
  "diagnosis_topic": "Pericardial tamponade secondary to stab wound to the chest",
  "tags": [
    "trauma",
    "cardiac tamponade",
    "penetrating chest"
  ],
  "setup_script": "A 32-year-old man is rushed to the ED after being stabbed in the left precordium. He is lethargic and complains of chest pressure. There is a 3 cm stab wound over the fifth intercostal space.",
  "dynamic_flow": [
    {
      "trigger": "If resident obtains vital signs",
      "reply": "BP 85/60 mmHg, HR 130 bpm, RR 30/min, SpO2 92% on oxygen."
    },
    {
      "trigger": "If resident observes jugular venous distension and muffled heart sounds",
      "reply": "Suggestive of tamponade (Beck's triad)."
    },
    {
      "trigger": "If resident orders FAST exam",
      "reply": "Pericardial view shows large anechoic fluid collection surrounding the heart with collapse of right atrium."
    },
    {
      "trigger": "If resident initiates fluid resuscitation",
      "reply": "Temporary improvement in blood pressure."
    },
    {
      "trigger": "If resident prepares for emergent pericardiocentesis in ED",
      "reply": "Needle decompression yields dark blood; hemodynamics transiently improve."
    },
    {
      "trigger": "If resident calls for operating room thoracotomy",
      "reply": "Median sternotomy performed to repair right ventricular laceration and evacuate clot."
    },
    {
      "trigger": "If resident delays intervention",
      "reply": "Patient deteriorates rapidly into pulseless electrical activity."
    },
    {
      "trigger": "If resident asks about indications for ED thoracotomy",
      "reply": "Penetrating chest trauma with witnessed signs of life and loss of pulses is an indication."
    },
    {
      "trigger": "If resident discusses postoperative care",
      "reply": "Monitor for arrhythmias, bleeding, and recurrent tamponade; consider ICU."
    },
    {
      "trigger": "If resident considers autotransfusion",
      "reply": "Crossmatched blood should be used rather than returning pericardial blood due to contamination."
    },
    {
      "trigger": "If resident reviews pathophysiology",
      "reply": "Tamponade impairs cardiac filling leading to obstructive shock."
    },
    {
      "trigger": "If resident mentions ultrasound training",
      "reply": "FAST can rapidly identify pericardial effusion in trauma."
    }
  ],
  "critical_decision_points": [
    "Recognition of cardiac tamponade and obstructive shock",
    "Use of FAST to diagnose pericardial effusion",
    "Emergent pericardiocentesis and definitive surgical repair",
    "Avoiding delays that lead to cardiac arrest",
    "Understanding indications for ED thoracotomy"
  ],
  "rubric": {
    "domains": {
      "Diagnostic Reasoning": {
        "weight": 0.25,
        "anchors": [
          {
            "score": 1,
            "description": "Fails to consider cardiac tamponade or misattributes symptoms to unrelated diagnoses."
          },
          {
            "score": 2,
            "description": "Delayed or incomplete differential diagnosis; overlooks key features of cardiac tamponade"
          },
          {
            "score": 3,
            "description": "Recognizes cardiac tamponade as a possibility but omits important alternative diagnoses."
          },
          {
            "score": 4,
            "description": "Develops a comprehensive differential including cardiac tamponade and systematically rules out other causes."
          },
          {
            "score": 5,
            "description": "Quickly identifies cardiac tamponade as the leading diagnosis and articulates a complete differential with supporting and refuting data."
          }
        ]
      },
      "Clinical Judgement": {
        "weight": 0.25,
        "anchors": [
          {
            "score": 1,
            "description": "Fails to recognize patient instability or need for timely intervention."
          },
          {
            "score": 2,
            "description": "Recognizes urgency but delays critical actions or orders inappropriate tests."
          },
          {
            "score": 3,
            "description": "Initiates basic work-up and management but misses key steps or timing."
          },
          {
            "score": 4,
            "description": "Prioritizes resuscitation, diagnostic testing and definitive therapy appropriately with good timing."
          },
          {
            "score": 5,
            "description": "Displays superb judgement by anticipating complications, coordinating multidisciplinary care and making timely decisions."
          }
        ]
      },
      "Communication": {
        "weight": 0.2,
        "anchors": [
          {
            "score": 1,
            "description": "Communication is disorganized, confusing, or lacks empathy toward the patient and team."
          },
          {
            "score": 2,
            "description": "Provides information but lacks clarity, structure or fails to engage patient/team."
          },
          {
            "score": 3,
            "description": "Clear communication of findings and plans but misses opportunities to confirm understanding."
          },
          {
            "score": 4,
            "description": "Communicates clearly, logically and empathetically with patient and interdisciplinary team."
          },
          {
            "score": 5,
            "description": "Exemplary communication: succinct, compassionate and anticipates information needs of patient and team."
          }
        ]
      },
      "Surgical Knowledge": {
        "weight": 0.2,
        "anchors": [
          {
            "score": 1,
            "description": "Lacks understanding of the operative or procedural management for cardiac tamponade."
          },
          {
            "score": 2,
            "description": "Identifies operative option for cardiac tamponade but with major gaps in technique or indications."
          },
          {
            "score": 3,
            "description": "Describes the key operative steps with minor omissions or uncertainties."
          },
          {
            "score": 4,
            "description": "Completely describes operative management, potential complications and alternatives for cardiac tamponade."
          },
          {
            "score": 5,
            "description": "Demonstrates mastery of current evidence, operative nuances and peri-operative considerations for cardiac tamponade."
          }
        ]
      },
      "Professionalism": {
        "weight": 0.1,
        "anchors": [
          {
            "score": 1,
            "description": "Displays disrespect, breaches patient confidentiality or fails to recognize limitations."
          },
          {
            "score": 2,
            "description": "Inconsistent respect or lapses in accountability and honesty."
          },
          {
            "score": 3,
            "description": "Maintains respect and integrity but requires prompting for self-reflection."
          },
          {
            "score": 4,
            "description": "Consistently respectful, accountable and receptive to feedback."
          },
          {
            "score": 5,
            "description": "Role model for professionalism, demonstrating humility, cultural sensitivity and ethical behavior."
          }
        ]
      }
    },
    "resident_feedback_template": "You recognized Beck's triad and performed a pericardiocentesis appropriately. Future improvement could include clearer discussion of indications for ED thoracotomy versus operating room intervention."
  }
}