{
  "case_id": "vascular_09",
  "title": "Dialysis Access Infection",
  "diagnosis_topic": "Infected arteriovenous fistula in a hemodialysis patient",
  "tags": [
    "vascular",
    "dialysis access"
  ],
  "setup_script": "A 60-year-old woman with end-stage renal disease on hemodialysis via a left forearm AV fistula presents with erythema, warmth and purulent drainage at the fistula site. She reports chills and fever.",
  "dynamic_flow": [
    {
      "trigger": "If resident requests vitals",
      "reply": "BP 100/60 mmHg, HR 105 bpm, RR 18/min, Temp 38.5 C."
    },
    {
      "trigger": "If resident inspects fistula",
      "reply": "Erythematous, indurated area over the fistula with purulent discharge; bruit still palpable; no hemorrhage."
    },
    {
      "trigger": "If resident orders labs",
      "reply": "WBC 14 K/uL, CRP elevated, blood cultures pending, creatinine 6.0 mg/dL (baseline)."
    },
    {
      "trigger": "If resident starts broad-spectrum antibiotics",
      "reply": "Cover staphylococci including MRSA (e.g., vancomycin)."
    },
    {
      "trigger": "If resident requests imaging",
      "reply": "Ultrasound shows localized abscess and patent fistula; no pseudoaneurysm."
    },
    {
      "trigger": "If resident consults vascular surgery",
      "reply": "Plan for incision and drainage of abscess with possible fistula ligation if infected segment extensive."
    },
    {
      "trigger": "If resident delays treatment",
      "reply": "Infection spreads leading to sepsis and potential loss of access."
    },
    {
      "trigger": "If resident inquires about timing of dialysis",
      "reply": "Arrange dialysis via temporary catheter if access is compromised."
    },
    {
      "trigger": "If resident asks about prevention",
      "reply": "Strict aseptic technique during cannulation, patient education."
    },
    {
      "trigger": "If resident asks about salvage procedures",
      "reply": "Interposition graft may salvage access if limited segment infected."
    },
    {
      "trigger": "If resident discusses systemic complications",
      "reply": "Endocarditis should be considered in bacteremic patients."
    },
    {
      "trigger": "If resident discusses culture results",
      "reply": "Tailor antibiotics based on sensitivities; typical pathogens include Staphylococcus aureus."
    }
  ],
  "critical_decision_points": [
    "Recognition of access infection and sepsis risk",
    "Empiric antibiotic therapy targeting staphylococci",
    "Imaging to assess extent of infection and patency",
    "Decisions regarding fistula salvage vs. ligation",
    "Coordination of dialysis access during treatment"
  ],
  "rubric": {
    "domains": {
      "Diagnostic Reasoning": {
        "weight": 0.25,
        "anchors": [
          {
            "score": 1,
            "description": "Fails to consider dialysis access infection or misattributes symptoms to unrelated diagnoses."
          },
          {
            "score": 2,
            "description": "Delayed or incomplete differential diagnosis; overlooks key features of dialysis access infection"
          },
          {
            "score": 3,
            "description": "Recognizes dialysis access infection as a possibility but omits important alternative diagnoses."
          },
          {
            "score": 4,
            "description": "Develops a comprehensive differential including dialysis access infection and systematically rules out other causes."
          },
          {
            "score": 5,
            "description": "Quickly identifies dialysis access infection as the leading diagnosis and articulates a complete differential with supporting and refuting data."
          }
        ]
      },
      "Clinical Judgement": {
        "weight": 0.25,
        "anchors": [
          {
            "score": 1,
            "description": "Fails to recognize patient instability or need for timely intervention."
          },
          {
            "score": 2,
            "description": "Recognizes urgency but delays critical actions or orders inappropriate tests."
          },
          {
            "score": 3,
            "description": "Initiates basic work-up and management but misses key steps or timing."
          },
          {
            "score": 4,
            "description": "Prioritizes resuscitation, diagnostic testing and definitive therapy appropriately with good timing."
          },
          {
            "score": 5,
            "description": "Displays superb judgement by anticipating complications, coordinating multidisciplinary care and making timely decisions."
          }
        ]
      },
      "Communication": {
        "weight": 0.2,
        "anchors": [
          {
            "score": 1,
            "description": "Communication is disorganized, confusing, or lacks empathy toward the patient and team."
          },
          {
            "score": 2,
            "description": "Provides information but lacks clarity, structure or fails to engage patient/team."
          },
          {
            "score": 3,
            "description": "Clear communication of findings and plans but misses opportunities to confirm understanding."
          },
          {
            "score": 4,
            "description": "Communicates clearly, logically and empathetically with patient and interdisciplinary team."
          },
          {
            "score": 5,
            "description": "Exemplary communication: succinct, compassionate and anticipates information needs of patient and team."
          }
        ]
      },
      "Surgical Knowledge": {
        "weight": 0.2,
        "anchors": [
          {
            "score": 1,
            "description": "Lacks understanding of the operative or procedural management for dialysis access infection."
          },
          {
            "score": 2,
            "description": "Identifies operative option for dialysis access infection but with major gaps in technique or indications."
          },
          {
            "score": 3,
            "description": "Describes the key operative steps with minor omissions or uncertainties."
          },
          {
            "score": 4,
            "description": "Completely describes operative management, potential complications and alternatives for dialysis access infection."
          },
          {
            "score": 5,
            "description": "Demonstrates mastery of current evidence, operative nuances and peri-operative considerations for dialysis access infection."
          }
        ]
      },
      "Professionalism": {
        "weight": 0.1,
        "anchors": [
          {
            "score": 1,
            "description": "Displays disrespect, breaches patient confidentiality or fails to recognize limitations."
          },
          {
            "score": 2,
            "description": "Inconsistent respect or lapses in accountability and honesty."
          },
          {
            "score": 3,
            "description": "Maintains respect and integrity but requires prompting for self-reflection."
          },
          {
            "score": 4,
            "description": "Consistently respectful, accountable and receptive to feedback."
          },
          {
            "score": 5,
            "description": "Role model for professionalism, demonstrating humility, cultural sensitivity and ethical behavior."
          }
        ]
      }
    },
    "resident_feedback_template": "You identified the infected fistula promptly and initiated appropriate antibiotics. Continue to work on balancing access salvage with eradication of infection and arranging alternate dialysis access."
  }
}